{"data":[{"identifier":"Instalace Linuxu","title":"Instalace Linuxu","content_blob":"## Obecně\n\n\n### Zdroj\n\n\nJako naprosto první věc budeme potřebovat zdroj baličků pro instalaci. Linux se šíří prostřednictvím distribucí, což je sada programů, které si můžeme nainstalovat. Distribuce jsou šířeny prostřednictvím snad všech medíí jaká známe. Mezi nejčastěji používané patří CD/DVD a síť.\n\n#### CD/DVD\n\n\nDistribuci získate jako bootovatelný disk obsahující základní systém, který vám pomůže s instalací vašeho systému. Za nevýhodu by se dalo považovat, že pokud je distribuce na hodně discích můžete mít snadno z jedné instalace systému tenisový loket.\n\n\n#### Síť\n\n\nZe stránek vámi vybrané distribuce si stáhnete miniaturní systém. Tento systém obsahuje akorát zavaděč jádra systému, dialogy a stahovací utilitu. Zavede se jádro, zobrazí se nám dialog co chceme aby náš instalační program uměl a utitlita nám stáhne komponenty instalátoru, které jsou potřebné. Takovéto instalátory jsou obvykle dělány na klasické diskety.\n\n\n### Co si vybrat\n\n\nNejčastější začátečnickou chybou je, že di uživatel začínající s linuxem zvolí špatnou distribuci a to ho od užívání linuxu odradí. Je dobré se zamyslet nad tím co budete od své distribuce požadovat. Pokud přecházíte na linux z finančních důvodů a chcete pouze systém, který vám ukáže internetovou stránku a otevře přilohu v mailu nemá cenu se mučit s prilíš komplexní ditribucí. Pokud však instalujete linux, aby jste se s ním naučili, je lepší sáhnout po distribuci, která nepřetéka grafickými rozhraními, aby vás to nutilo dělat si vše sami. Podle toho co od svého budoucího systému očekáváte bych vás roydělil do následujících 2 skupin:) Pokud se do žádné nevejdete, tak mi napište ze sekce Contact a něco s tím uděláme;)\n\n#### Chci jen kliknout a mít použitelný systém\n\n\nNejjednodušší je najít ve svém okolí někoho, kdo již nějakou dobu na svém počítači linux provozuje a nechat si od něj distribuci vašich snů donést, popřípadě se ho jen zeptat kde by jste ji mohli sehnat. Pokud nikoho takového ve svém okolí nemáte sáhněte po distribuci Ubuntu, SuSE a jim podobné. Jsou uživatelsky přítulné a umožňují instalaci podle profilu budoucího systému bez toho aniž by se musely vybírat jednotlivé balíčky.\n\n\n#### Linux je fakt \"hustej\" a chci s tim pořádně umět\n\n\nNa lidičky z této skupiny čeká docela velké \"peklo\". Většině lidí trvá dlouho, než se s linuxem naučí, tak aby ho mohli obstojně používat. Než se dostanou na uživatelskou úroveň, systém je omrzí. Nemá cenu se hned ze začátku trápit s tím, že něco neděláte tak jek se to dělat má v čistém linuxu. Skloubenim techto cest je, že uživatele již učení se omrzí a do fáze, kdy pracují se skutečným linuxem se vůbec nedostanou. I když doporučuji všem přátelům sahat po takovýchto distribucích sahat až tak po roce užívání linuxu, kdy si je člověk jist svými vědomostmi, neznamená to, že po takovéto distribuci nemůžete sáhnout ihned. Pokud vám nikdo žádnou nedoporučí, zkuste FreeBSD, Debian, Slackware a jim podobné.\n\n\n#### Je to \"cool\", ale na svůj stroj to zatím nechci\n\n\nJe zde i tato možnost. Ze stránek distribuce si stáhnete obraz disku, který vypálíte a systém vám běží z tohoto disku. Neděste se toho co jsem psal v první části. Tyto systémy (jsou označovány slovíčkem live) jsou, co se softwarové výbavy týče, velice dobře vybaveny. Samozřejmě záleží na tom na jakou to narazíte distribuci. Doporučit mohu Kororaa, Ubuntu, (varianta live samořejmě) , DeadCD (dnes již možná spíše Olive). Dvě naposled zmíněné jsou minimalistické. To znamená´, že si kladou za cíl být co nejmenší. U live distribucí je povětšinou možné nahrát obsah celého disku do operační paměti. DeadCD a Olive jsou mometálně vyvýjeny tak, aby měly okolo 100MB. O tom jaké výhody má nahrání celého systému do operační paměti snad ani nemusím mluvit.\n"},{"identifier":"Nemám ICQ","title":"Nemám ICQ","content_blob":"Ahoj,\ndost z vás se mi často pokouší něco posílat přes ICQ a nejde vám to. Je to tím, že já [nemám ICQ](http://icq.xmpp.cz/). Používám decentralizovanou síť [Jabber](http://www.jabber.cz/wiki/Jabber). Do sítě ICQ přistupuji přes takzvaný [transport](http://www.jabber.cz/wiki/ICQ_transport). Jelikož je ICQ a jeho protokol [proprietární](http://cs.wikipedia.org/wiki/Propriet%C3%A1rn%C3%AD_software) velice težko se daří s ICQ komunikovat jiným vývojářům než těm z AOLu (Společnost vyvýjecí a provozující ICQ). To způsobuje, že mi od vás místo normálního textu občas příjde jenom změť azbuky ze které občas vykoukne něco smysluplného (k tomuto problému občas docházelo i pokud měli dva uživatelé jinou verzi ICQ).\n\nDalší věc je, že [licence ICQ](http://www.root.cz/clanky/uskali-licence-icq-mnoho-neznamych-omezeni/) kterou jenom ledabyle odsouhlasíte jasně říka, že pokud jí porušíte a příde se na to, tak vám AOL klidně může bez varování váš účet zrušit (jenom podotknu podle statistik jí porušují snad všichni uživatelé).\nPro Jabber je spousty [klient](http://www.jabber.cz/wiki/Kategorie:Klienti )ů, takže si můžete opravdu vybrat ten který vám nejvíce vyhovuje a Jabber vám poběhá ve všech klientech stejně (samozřejmě že je možné, že nějaký klient neumí to co jiný).\n"},{"identifier":"Jabber - Jabber/XMPP","title":"Jabber - Jabber/XMPP","content_blob":"## Je to něco jako... ICQ\n\nAsi nikomu neunikla existence komunikační sítě ICQ. Je vlastněna a provozována společností AOL. U nás se po pár letech existence ICQ provozování ujal ATLAS.cz.\n\nHlavně kvůli zaběhnutému ICQ se lidé zdrahají přejít do jiných sítí. Jejich přátelé již mají ICQ, tak proč by měly mít oni něco jiného( ICQ jako takové neumožňuje spojení s uživateli v jiných komunikačních sítích )\n\n### A hůrá na to\n\nDost jsem toho již napsal do postu [Nemám ICQ](http://www.rooland.cz/2007/09/05/nemam-icq/), takže pro ty kdo ho nečetli to pišu znovu a pro ty kdo to četli je tu takové zdravé opáčko.\n\n#### Decentralizovaná komunikační síť\n\nŽe je tato síť decentralizovana pro uživatele až tak moc neznamená. Krása tohoto aspektu se projevi az když se o věc začnou zajímat šťouralové, kteří si se všim chtějí pořádně pohrát, nebo lidičky co budují nejakou komunikacni sit. Pokud nekoho takoveho mate ve svem okoli může vám udelat Jabber server jen pro vaší partu, školu, nebo třeba i podnik( práce asi na pulhodinky čistého času na instalaci serveru ). Takovy server je mozne bezplatně a ještě k tomu legálně stáhnout z webu. Stejně tak jak je tomu u klientů, tak je tomu i u serveru. Totiž že existuje celá řada serverů a každý ma své plusy a mínusy je jen na vas jaký si vyberete.\n\n#### Otevřené standarty\n\nU otevřených standartů to chodi, tak že někdo přijde na chybu a \"flakne\" ji na web. Celá komunita co se zabývá vývojem začne pracovat na jejim odstaneni. U uzavřenych standartů se firma, ktera software vyviji snaží dělat jako by se nechumelilo, dokud to jenom jde. Když by jsme se nad tim zamysleli, tak pro firmu vyjde nejlip pořídit si nejake komerční řešení, které je jen mirnou modifikaci komunitniho softwaru. Chyba je vždycky odhalena v kratkem case.\n\n### A to si teda musim něco stahovat, jo?\n\n\nDo sítě Jabber se připojujete prostřednictvím klientů. Oproti ICQ existuje více než pět kvalitních klientů pro připojení do této sítě.\n\n#### [Psi](http://psi-im.org/ \"Psi - Homepage\")\n\nJedná se o vcelku moderního klienta. Umožňuje procházení a registraci nových služeb, posílání a příjem zpráv, posílání a příjem souborů. Klient je napsán v grafické knihovně Qt. Pro linuxové uživatele tento fakt znamená( pokud nepoužívají KDE ), že jenom kvůli tomuto klientovi budou muset mít nainstalovánu knihovnu Qt. Ve windows je určitá úleva v tom, že Psi neobsahuje celou knihovnu, ale jen to co z ní používá. Graficky může zapálené Widláky trochu odradit, že zde nejsou obrovské barevné obrázky, ale vcelku praktické malé ikony, takže na skutečný obsah( jméno kontaktu, jeho stav, události ) pak zbyde více místa. Spojen je s tím i celek - celé okno pak zabírá méně místa. Okno komunikace jde stejnou cestou. Můžete si nastavit jestli se bude zobrazovat hezoučká obrázečková nabídka, nebo jestli si budete funkce vybírat z nabídky.\n\n#### [Pidgin/Gaim](http://www.pidgin.im/ \"Domovská stránka projektu Pidgin\")\n\nPidgin je klient napsaný v grafické knihovně [GTK](http://www.gtk.org/ \"Domovská stránka projektu GTK+\"), ve které je napsaná valná část valně oblíbených projektů( [GIMP](http://www.gimp.org/ \"Domovská stránka grafického editoru GIMP\"), [Avidemux](http://fixounet.free.fr/avidemux/ \"Domovská stránka video editoru Avidemux\"),... ). Pokud již nějaký takový máte nainstalovaný s instalací Pidgina se vám bude instalovat pouze tento klient( v opačném případě ještě knihovna GTK;) ). Výhoda tohoto klienta spočívá v tom, že je oproti okolo popisovaným více-protokolový( AIM, Bonjour, Gadu-Gadu, Google Talk, Groupwise, ICQ, IRC, MSN, MySpaceIM, QQ, SILC, SIMPLE, Sametime, XMPP, Yahoo!, Zephyr ). Před nějakým časem jsem dokonce narazil i na [plugin pro připojení do chatu sítě Facebook](http://code.google.com/p/pidgin-facebookchat/ \"Stránka vývojářu pluginu pro Facebook chat\").Tento klient vám tedy poskytuje možnost být souběžně online v síti ICQ i Jabber s výhodami těchto sítí a třeba po roce zhodnotit, která síť je pro vás lepší, či jestli vám nějací lidé na Jabberu přibývají.\n\n#### [Bombus](http://translate.google.com/translate?u=http%3A%2F%2Fbombus-im.org%2F&hl=cs&ie=UTF-8&sl=ru&tl=cs \"Domovská stránka projektu Bombus, přeložena z ruštiny\")\n\nTento klient je pro opravdové závisláky. Je totiž cílem na mobilní zařízení.\n\n#### mChat\n"},{"identifier":"Tak jak na ten Jabber?!","title":"Tak jak na ten Jabber?!","content_blob":"### Klient\n\nJak už ste si asi několikrat přečetli, budete potřebovat klienta. Skoro by se dalo říci, že klientem to všechno začíná i končí.\n\n### Obecně\n\nVětšina klientů vás při prvním spuštění vyzve k zadání přihlašovacích údajů. Jistě si asi říkáte co klientovi předhodit, když vlastně  nic takového nemáte. K tomu slouží políčko na první( někdy druhé ) dotazníkové stránce( stále jsme v klientovi ). Obvykle je popsané jako zaregistrovat tento účet, nebo něco na ten způsob co dá klientovi najevo, že nevládnete žádným účtem, kterým by jste se mohli klientovi představit. Nebojte se těch termínů, nejedná se o žádné bankovní služby:).\n\nZ ICQ jste nejspíš zvyklí, že vám bylo přiděleno nějaké jedinečné číslo, které se pokud možno co nejhůře pamatovalo( UIN ). Takovou obdobou UIN je v sitích jabber JID. Je ve tvaru pepa@vopruz.uje. \"Pepa\" musí být jedinečné jméno na serveru \"vopruz.uje\". Tak jako jinde platí, že kdo dřív příjde ten dřív mele, takže pokud jste pepou a někdo si již jméno \"pepa\" zaregistroval, tak si musíte vypomoci nějakými paskvily ve stylu \"p3pa\" a tak podobně. Nechám na vaší představivosti jaké jméno si vyberete. Niga, nyga, nigha, nygha, n1ga, atp. mám již na většině serverů zaregistrováno dražba bude začátkem roku někde na roolandu.Vybrat si mužete i <a title=\"Seznam serverů\" href=\"http://www.jabber.org/user/publicservers.shtml\" target=\"_blank\">server</a>, aby jste nopobuřovali sve nenapudrované kámoše:). Z českých uvedu snad jen <a title=\"Český Jabber server\" href=\"http://www.jabber.cz/wiki/Hlavn%C3%AD_strana\" target=\"_blank\">jabber.cz</a>, <a title=\"Jabbim CZ - Jabber server\" href=\"http://www.jabbim.cz/\" target=\"_blank\">jabbim.cz</a>, njs.netlab.cz a pak samozřejmě ten váš, který teprve prorazí:) Všechny tyto servery jsou provozovany firmou <a title=\"Kontakt\" href=\"http://www.jabbim.cz/contacts.html\" target=\"_blank\">Humboltec</a>. Je zde i možno si připlatit za <a title=\"Co za to dostanu?\" href=\"http://www.jabbim.cz/vip-benefit.html\" target=\"_blank\">VIP služby</a>, které vaše služby ještě více zpříjemní. V současnosti se nejedná se o nějakou šílenou částku a řekl bych, že některé služby za to i stojí. Kdo má už z podstaty v nenávisti pyramidy, tak tady se nic takového nekoná, nebo to aspoň není cílem služby. Peníze jdou na rozvoj, údržbu a provozování serveru. Pokud chcete být evropští, tak se můžete se svým přítelem registrovat na <a title=\"jabber.eu, xmpp.eu a pár dalších xmpp.\" href=\"https://xmpp.eu/\" target=\"_blank\">jabber.eu</a>.\n\nJsme registrovaní na serveru a teď už můžeme vesele brebentit.\n\n### Psi\n\nPost doplním vlastními obrázky hned jak na to budu mít čas\n\nNa stránce jsou použity obrázky z wiki na <a title=\"Wiki na jabber.cz\" href=\"http://www.jabber.cz/wiki/Hlavn%C3%AD_strana\" target=\"_blank\">jabber.cz</a>.\n"},{"identifier":"Jak na Jabber/XMPP server","title":"Jak na Jabber/XMPP server","content_blob":"## Co budu potřebovat\n### Software\n\nJak je asi jasné pudete potřebovat nějaké to železo a nějaký ten <a title=\"Seznam Jabber serverů\" href=\"http://www.jabber.org/software/servers.shtml\" target=\"_blank\">software</a>. Zatím jsem zkusil <a title=\"Stránky projektu\" href=\"http://www.process-one.net/en/ejabberd/\" target=\"_blank\">ejabberd</a> a <a title=\"Stránky projektu\" href=\"http://www.igniterealtime.org/projects/openfire/\" target=\"_blank\">Openfire</a>, takže se bude vše vztahovat k těmto kouskům s tím že pokud vyzkouším nějaké další, tak si to moc dlouho nenechám pro sebe.\n\n### \"Železo\"\n\nZáleží na tom co budete od svého Jabber serveru chtít a který server zvolíte. Doma mi na 650MHz, 128MB v pohodě běží ejabberd pro pět uživatelů u Openfiru to jde už trochu ztuha. Pokud máte v plánu nějaký velkolepý server je zde samozřejmě lepší sáhnout po silném stroji Oba dva se samozřejmě docela dlouho spouští.\n\n## ejabberd\n\nTento server je napsaný v jazyce <a title=\"Stránky projektu\" href=\"http://www.erlang.org/starting.html\">Erlang</a> a je tedy snadno spustitelný na platformách pro které je portován Erlang Virtual Machine. Ihned po instalaci máte běžící základní Jabber server. Ve webovém rozhraní sice nastavíte všechno, ale už to není zas tak pohodlné jako je tomu u Openfire. Pokud se rozhodnete pro podnikové nasazení je zde velice zajímavá funkce sdílených rosterů, takže si nemusí každý pracovník přidávat kontakty na celé vaše zámožné impérium, ale objeví se mu ihned po prvním přihlášení.\n\n## Openfire( dříve wildfire )\n\nTento server je napsaný v <a title=\"Český portál o Javě\" href=\"http://java.cz/\">Javě</a>, takže ho také spustíte defakto kdekoliv. Po nainstalovaní vás přívětivé webové rozhraní provede doinstalací a máte běžící server. K samotnému Jabber serveru si můžete ještě napluginovat SIP( IP telefonie ), integraci s Asterikem( telefoní ústředna ). Stejně jako instalace i administrační rozhraní je velice uživatelsky přívětivé. Tento server je poněkud větší zátěž, ale je dělán více pro běžné uživatele, kteří chtějí pro své přátelé udělat Jabber server.\n"},{"identifier":"IdleCE","title":"IdleCE","content_blob":"Editor je napsaný v jazyce Python. Pro fungování IdleCE a jiných Pythoních aplikací je potřeba mít nainstalovaný <a title=\"Python Windows CE port\" href=\"http://sourceforge.net/projects/pythonce/\" target=\"_blank\">PythonCE</a>( v mém případě je to `Python 2.5 (release25-maint, Oct  4 2007, 14:58:33) [MSC v.1400 32 bit (ARM)] on win32` - zobrazí se po spuštění Python interpretru ). Další co budete potřebovat je Tkiner - grafická knihovna, která je v případě IdleCE použita pro napsání grafického rozhraní. Ke stažení je k dispozici na stejné adrese jako PythonCE( hledejte u verze <a id=\"pkg0_7rel0_0\" title=\"Python Windows CE port - Python/CE 2.3.4-1\" href=\"http://sourceforge.net/project/showfiles.php?group_id=104228&amp;package_id=112011&amp;release_id=254865\" target=\"_blank\">Python/CE 2.3.4-1</a> ). Ze staženého zipu extrahujte obsah adresáře `tcl8.4.3` do rootu média na kterém máte Python nainstalovaný( v mém případě je to karta, takže do `Storage Card` ). Obsah druhého adresáře extrahujte do systémového v paměti vašeho zařízení. Existuje jistě i jiná dvojice cílových adresářů( a nemůsí to být dvojice:) ), ale tuhle jsem zkusil jako první a fungovalo to:). Pokud zkusíte spustit Idle před kopírováním Tkiner na zařízení, intepretr vyhodí chybovou hlášku, která obsahuje cesty ve kterých Python knihovny hledá. Nyní si stáhněte IdleCE. <a title=\"IdleCE\" href=\"http://kitsu.petesdomain.com/files/WinCE/IdleCE-2.0.zip\">http://kitsu.petesdomain.com/files/WinCE/IdleCE-2.0.zip</a>. Nyní již můžete spustit IdleCE.py.\n\nDoufám, že vše funguje tak jak má. Pokud ne, tak napište a zkusíme najít nějaké řešení.\nTento post pojednává o zprovoznění Pythonýrského editoru textu Idle na Kaiserovi( divil bych se kdyby se postup na jiných zařízeních lišil ).\n\nVycházím z návodu na <a title=\"python+zope++:: Python on PocketPC\" href=\"http://myzope.kedai.com.my/blogs/kedai/66\" target=\"_blank\">http://myzope.kedai.com.my/blogs/kedai/66</a>. Pokud je již článek smazán v příloze je jeho kopie( <a title=\"python+zope++:: Python on PocketPC\" href=\"http://www.rooland.cz/?attachment_id=11\">python+zope++:: Python on PocketPC</a> )."},{"identifier":"Linux a NFS ( Sdílení v Linuxu )","title":"Linux a NFS ( Sdílení v Linuxu )","content_blob":"Predtim nez zacnete se ujistete, ze mate nainstalovane baliky nfs-kernel-server a nfs-common. Celá konfigurace spocivala v editaci tří souborů:\n\n**/etc/hosts.allow** *Obsahuje seznam strojů, které mohou přistupovat k místním službám*\n\n    lockd: 192.168.1.0/255.255.255.0\n    rquotad: 192.168.1.0/255.255.255.0\n    mountd  192.168.1.0/255.255.255.0\n    statd 192.168.1.0/255.255.255.0\n\nZde nastavované služby používá nfs pro své fungování.\n\nSyntaxe je: `služba: adresa`\n\nAdresa může být buď pro počítač, či síť. Pokud by jste chtěli zadat více adres. Musíte je oddělit mezerami. Já jsem zvolil síť, abych nemusel přidávat počítač pokaždé, když někdo přijde a bude si chtít prohlédnout mé fotky, či tak něco. Pokud bych chtěl například povolit přístup ke službě lockd pro výše zmíněnou síť a jeden počítač 192.168.0.10 vypadalo by to asi takto:\n\n    lockd: 192.168.1.0/255.255.255.0 192.168.0.10\n\n**/etc/hosts.deny**\n\nFunkčně se jedná o podobný soubor jako předešlý, ale slouží k opačnému účelu. Uvádí se zde počítače a sítě, které ke svému spinavému prádlu pustit nechcete.</blockquote>\n\n**/etc/exports**\n\nTento soubor již konečně obsahuje nastavení toho jaké adresáře se mají sdílet a jak. Syntaxe je podobná jako u předešlých souborů.\n\n    /media/         192.168.1.0/255.255.255.0(ro)\n\nSyntaxe je opravdu hodně podobná. První na řádku je adresář, který budeme sdílet. Následuje adresa počítače, či sítě, který s může s daným adresářem dělat to co je nalepené hned u adresy. Jako u předešlých souborů můžete za mezeru vkládat další a další stroje, či sítě.\n\nPro načtení nastavení sdílení zadejte v konzoli jako uživatel root příkaz:\n\n    mujstroj:/# exportfs -ra\n    \nPokud jste vše nastavili správně, tak by jste měli na jiném počítači vidět služby běžící na vámi nastavovaném stroji:\n\n    pepa@depo:/$ rpcinfo -p mujstroj\n    program vers proto   port\n    100000    2   tcp    111  portmapper\n    100000    2   udp    111  portmapper\n    100003    2   udp   2049  nfs\n    100003    3   udp   2049  nfs\n    100003    4   udp   2049  nfs\n    100021    1   udp  32770  nlockmgr\n    100021    3   udp  32770  nlockmgr\n    100021    4   udp  32770  nlockmgr\n    100003    2   tcp   2049  nfs\n    100003    3   tcp   2049  nfs\n    100003    4   tcp   2049  nfs\n    100021    1   tcp  40920  nlockmgr\n    100021    3   tcp  40920  nlockmgr\n    100021    4   tcp  40920  nlockmgr\n    100005    1   udp  32771  mountd\n    100005    1   tcp  34484  mountd\n    100005    2   udp  32771  mountd\n    100005    2   tcp  34484  mountd\n    100005    3   udp  32771  mountd\n    100005    3   tcp  34484  mountd\n    100024    1   udp  32797  status\n    100024    1   tcp  58528  status\n\nPokud jste viděli něco podobného, tak již niní můžete připojit adresář z druhého počítače. V našem případě připojíme z počítače depo adresář z počítače mujstroj\n\n    pepa@depo:/$ sudo mount mujstroj:/media/ /mnt/mujstroj_media/\n    pepa@depo:/$ ls /mnt/mujstroj_media/\n    cdrom  cdrom0  floppy  floppy0  ipod  usb\n\nZdroje:\n\n<a title=\"Linux NFS-HOWTO\" href=\"http://nfs.sourceforge.net/nfs-howto/index.html\"><strong>http://nfs.sourceforge.net/nfs-howto/index.html</strong></a>\n<blockquote>Asi nejdůležitější jsou tam:\n<blockquote><a title=\"3. Setting Up an NFS Server\" href=\"http://nfs.sourceforge.net/nfs-howto/ar01s03.html\"><em>http://nfs.sourceforge.net/nfs-howto/ar01s03.html</em></a>\n<a title=\"4. Setting up an NFS Client\" href=\"http://nfs.sourceforge.net/nfs-howto/ar01s04.html\"><em>http://nfs.sourceforge.net/nfs-howto/ar01s04.html</em></a>\n<a title=\"7. Troubleshooting\" href=\"http://nfs.sourceforge.net/nfs-howto/ar01s07.html\"><em>http://nfs.sourceforge.net/nfs-howto/ar01s07.html</em></a></blockquote>\n</blockquote>\nDobrý večer, pokud jdete kalit, dobré ráno pokud už jste zvraceli. V tomto postu popíšu jakže se dá v linuxu nasdílet adresář. Překvapilo mě jak je to jednoduché, takže jsem možná vynechal některé drobnosti, které nejsou až tak důležité, ale funguje to no:)"},{"identifier":"SVN - Vy, vysokÃ½, vÃ½t, vyvÃ­jÃ­me spoleÄnÄ","title":"SVN - Vy, vysokÃ½, vÃ½t, vyvÃ­jÃ­me spoleÄnÄ","content_blob":"Pokud chcete začít svn používat pro soukromé vývíjení, tak nejsnažší cesta je zaregistrovat se na <a href=\"http://code.google.com/hosting/createProject\">Google</a>, nebo <a title=\"Registrace na sf.net\" href=\"http://sourceforge.net/account/registration/\">Sourceforge</a>( nabízí i CVS ). Na obouch dvou musíte mít nejdříve učet a pak teprve založit projekt. Na sf.net sice trvá celkem dlouho, než projekt projde schvalovanim, ale zato pak máte více možností. Předesílám, že pokud člověk něco vyvíjí sám, tak pro něj tyto služby nemají až takový smysl a je lepší si <a title=\"Popis instalace Subversion\" href=\"http://svnbook.red-bean.com/en/1.4/svn.intro.install.html\">SVN</a>, či <a title=\"Popis instalace CVS\" href=\"http://www.idevelopment.info/data/Programming/change_management/unix_cvs/PROGRAMMING_Installing_CVS.shtml\">CVS</a> rozjet lokálně.\n\nPři prvním nahrávání a při nahrávání zcela nových souborů užijete akci <a title=\"Detailní popis akce import\" href=\"http://svnbook.red-bean.com/en/1.0/re12.html\">import</a>.\n\n    svn import -m \"Komentar k importu\" lokalni_adresar_se_zdrojaky/  \\\n    https://nazev_vaseho_projektu.svn.sourceforge.net/svnroot/nazev_vaseho_projektu \\\n    --username=vase_uzivatelske_jmeno\n\n**svn** je binárka subversion, **import** je akce, kterou zrovna provádíte, **-m** \"cosi\" je komentář k právě prováděné akci( uvdíte později ), **lokalni_adresar_se_zdrojaky/** je lokání umístění importovaných souborů a za ním následuje adresa vašeho repozitáře SVN. Posledním parametrem je **--username** jak je z něj patrné označuje vaše uživatelské jméno pro repozitář nad kterým právě provádíte akci.\n\nSVN má dále tři nejvíce používané akce:\n\n### checkout\n\nVytvoří lokální kopii souborů z repozitáře &ndash; pracovni kopie.\n\n    svn co \\\n    https://nazev_vaseho_projektu.svn.sourceforge.net/svnroot/nazev_vaseho_projektu\n\nTo znamená, že soubory stáhne do lokálního adresáře a vytvoří k nim informační soubory, které obsahují data o verzi lokálního souboru a adrese repozitáře ze kterého pochazí. Místo <strong>co</strong> můžete také použít <strong>checkout</strong>, ale kdo by psal to delší, když nemusí, že:)\n\n### commit\nSlouží pro nahrávání změn v repozitáři existujících souborů\n\n    svn commit -m \"Popis toho co jste se soubory udelali\"\n\nMožná vám přijde trochu divné, pročpak to má tak málo parametrů. Tento příkaz se spoušti v kořenovem adresáři vašich vyvíjených souborů, takže data o repozitáři a verzích jsou načitána z adresářové struktury aktuálního adresáře, takže je nemusíte( možná ani nemůžete ) zadávat.\n\n### update\nSlouží pro aktualizaci lokální kopie.\n\n    svn update\n\nMezi tím co jste pracovali možná pracoval na souborech i někdo jiný v týmu, takže je dobré si čas od času lokální kopii aktualizovat. Opět zde platí, že data o repozitáři a verzích nezadáváte, protože jsou obsažena v adresářové struktuře vašich souborů.\n\nVýše jsem popsal konzolové příkazy. Pokud se jim chcete vyhnout, tak celkem ušle pracuje s SVN <a title=\"Netbens ke stažení\" href=\"http://www.netbeans.org/downloads/\">Netbeans</a> a <a title=\"jEdit ke stažení\" href=\"http://www.jedit.org/index.php?page=download\">jEdit</a>. Práci s SVN v Netbeans a jEditu se nejspíše budu věnovat v nějkém z pozdějších postů. Pokud by vám zde nějaká informace chyběla, neváhejte napsat mi mail, nebo do příspevků.\nV tomto článku popisuji základní práci se <a href=\"http://en.wikipedia.org/wiki/Subversion_(software)\">Subversion</a>(SVN) a programy pro hostování projektů na SVN. Neřeším teď jeho kvality, nebo vhodnost na něco. Prostě s ním pracuji, tak o něm píšu."},{"identifier":"Google služby","title":"Google služby","content_blob":"### <a href=\"http://gears.google.com/\">Google Gears</a>\nV současné době je trend dělat webové služby co nejbohatší - <a title=\"Socialní web Facebook\" href=\"http://www.facebook.com/\">Facebook</a>, <a title=\"Web e-mailového řešení od společnosti Google\" href=\"https://gmail.com\">GMail</a>, <a title=\"Web YouTube - služba pro sdílení videa\" href=\"http://www.youtube.com/\">YouTube</a>, <a title=\"Ukázky JS frameworku, který slouží pro vývoj přívětivých webových aplikací\" href=\"http://extjs.com/deploy/dev/examples/samples.html\">Ext JS</a>. Webové stránky jsou obvykle tvořeny v jazyce <a title=\"HTML na wikipedii\" href=\"http://cs.wikipedia.org/wiki/Html\">HTML</a>. S narůstající velikostí webových stránek se objevila potřeba zrychlit jejich transport ze serveru ke klientovi( jejich návštěvníkovi ). Nejrychlejší cesta jak dostat ke klientovi kýženou stránku, či její součást, je přenést jí jenom jednou a pak už ať si jí prohlíží ze svého počítače. S novou verzí <a title=\"Specifikace HTML 5\" href=\"http://dev.w3.org/html5/spec/Overview.html\">HTML</a> ( html 5 na <a title=\"O HTML 5 na intervalu\" href=\"http://interval.cz/clanky/seznameni-s-html-5/\">inervalu</a>, <a title=\"Sekce na root.cz věnovaná HTML 5\" href=\"http://zdrojak.root.cz/n/html5/\">rootu</a> a <a title=\"O HTML 5 na wikipedii\" href=\"http://en.wikipedia.org/wiki/HTML_5\">wikipedii</a> ) má být tato možnost automatickou. Odhad na dobu potřebnou pro implementaci do všech prohlížečů hovoří o dvaceti letech, kdy už ale bude plně funkční.\n\nProč tu tohle všechno píšu? Google Gears to již nabízejí dnes trošku méně pohodlné formě. Nainstalujete si gears( většinou jste o to požádáni při navštívení stránky, která Google Gears využívá ) a můžete k obsahu, který je k tomu určen přistupovat z lokálního disku. Součásti stránky se vám tedy stahují pouze když je k dispozici jejich novější verze, to znamená jejich rychlejší načítání. Nepohodlnost o které jsem psal spočívá v tom, že musíte mít nainstalovány Google Gears, nebo <a title=\"Stránky Webového prohlížeče od společnosti Google\" href=\"http://www.google.com/chrome/\">Google Chrome</a>, které by již mělo mít tuto funkci zabudovánu. Pro vývojáře stránek využívající Gears to znamená, že musí obsah určený k archivaci u klienta patřičně označit( viz. <a title=\"Tutorial k vužívání Google Gears ze strany vývojářů stránek\" href=\"http://code.google.com/intl/cs-CZ/apis/gears/tutorial.html\">Tutorial</a> ).\n### <a onclick=\"javascript:urchinTracker('/intl/cs/options/outbound/gmail');\" href=\"http://mail.google.com/mail?hl=cs&amp;utm_source=cs-et-more&amp;utm_medium=et&amp;utm_campaign=cs\">Gmail</a>\nJedná se o emailové řešení od společnosti Google. Někteří lidé opuštějí své destopové klienty na poštu a pozvolna se přesouvájí na webová rozhraní, protože mají všude to samé prostředí na práci se svojí poštou a navíc je to pořád ta stejná pošta Před nedávnem společnost Google dokonce přidala možnost využít výše zmíněné Google Gears v tomto řešení. Pro uživatele to tedy znamená, že při každé navštěvě GMailu se mu synchronizují zprávy na serveru GMailu s těmi co má k dispozici lokálně na svém počítači. Když se pak uživatel ocitne s tímto počítačem někde mimo připojení k internetu, má pořád svojí poštu i své rozhraní s sebou.\n### <a class=\"l\" onmousedown=\"return clk(this.href,'','','res','1','&amp;sig2=RopzxXo0DuS-9rja_FwNFQ')\" href=\"http://www.google.com/calendar\"><em><span style=\"font-style: normal;\">Google Calendar</span></em></a>\nJedná se o online nástroj na organizaci času. Je možné si zde zapisovat své události, aby jste na ně nezapoměli, či aby ostatní věděli co pořád děláte, že na ně nemáte čas;) Jak jsem v minulé větě naznačil je možné svůj kalendář sdílet se všemi uživateli Google Calendar, či jen s některými, nebo dokonce s žádnými s běžným povolením. Můžete i napřiklad někomu nasdílet svůj kalendář, ale s tím že uvidí pouze jestli máte čas( neuvidí názvy událostí, nebo jejich detaily ). Tímto způsobem se například řeší přídání národních svátků do Google Calendar. Zajímavou možností je <a title=\"Sekce v nápovědě služeb Google věnující se právě synchronizaci s mobilními zařizeními\" href=\"http://www.google.com/support/a/bin/answer.py?hl=en&amp;answer=138652\">synchronizace vašeho Google Calendar se zařizením</a> s Windows Mobile, či iPhonem. Během několika hodin tedy máte události, které si přidáte do Google Calendar i na svém mobilním zařízení.\n\n### <a href=\"http://picasa.google.com/intl/cs_all/\">Picasa web</a>\n\nJedná se o webovou službu nabízející práci s fotografiemi na úrovni distribuce a lehce na úrovni úprav. Nahrajete si sem třebas své fotografie z dovolené a můžete je sdílet se vými přáteli, všemi, nebo také s nikým( kromě Google;) ) a mít je zde jenom jako  pomyslnou tu skříň fotkami do které již nikdy nevlezete dokud tam nebude potřebovat dát další fotky;). Picasa web ještě nabízí jednu velice zajímavou funkci. Je jí <a title=\"Stránka věnující se name taggingu v Google Picase\" href=\"http://picasa.google.com/intl/en_us/features-nametags.html\">name tagging</a>. Označite lidi na fotografiích a pokud si jsou na dalšich ( pro Picasu;) ) dostatečně podobní, tak je tam označí také. Když pak hledáte něčí fotku, velice se vám to touto funkcí ulehčí. Další zajímavou funkcí je Slideshow( nevim jak se tomu řiká v češtině, kdo to ví ať napíše:) ). Dejme tomu, že někomu chcete ukázat své fotografie a je právě s vami, tak mu pustíte slideshow, přímo v prohlížečí, nebo pokud s vámi není, tak mu na ní alespoň pošlete odkaz.\n\n### <a title=\"Personalizovaná stránka pro vyhledávání na Google.com\" href=\"http://www.google.com/ig\">iGoogle</a>\n\nAsi každý zná vyhledávač společnosti Google. iGoogle je možnost jak si ho obohatit. Pod samotné vyhledávací políčko si můžete přidat ruzné widgety k tomu určené. Z mnou používaných uvedu snad jen Google Bookmarks, RSS, IDOS. Na vyběr z toho co si na svoje personalizované vyhledávání dáte slouží <a href=\"http://www.google.cz/ig/directory?hl=cs&amp;root=/ig&amp;dpos=top\">adresář gadgetů</a>. Dále máte možnost si vytvořit svůj, přes <a href=\"http://www.google.cz/ig/gmchoices?hl=cs\">průvodce vytvářením gadgetů</a>, nebo si napsat svůj vlastní( <a title=\"Tutoriál ke psaní Google Gadgets\" href=\"http://www.seoish.com/how-to-make-google-gadgets/\">tutorial</a> ). Další věc kterou si můžete je svou iGoogle stránkou vyzdobit jsou skiny. Můžete si nastavit vzhled z <a href=\"http://www.google.cz/ig/directory?type=themes&amp;dpos=themes\">galerie vzhledů</a>, který se vám líbí. Ještě podotknu, že pokud nemáte učet na Google, tak jsou vámi prováděné úpravy pouze lokální.\n\n### <a href=\"http://www.google.com/webmasters/tools/\">Webmaster Tools</a>\n\nTato služba je určená pro vývojáře stránek. Dává vám k dispozici nástroj pro prohlížení dat o vašich stránkách, tak jak je vidí vyhledávač Google. Odstranění chyb ve vašich stránkách, které vám tento nástroj oznámí vám však mohou být ku prospěchu i jinak, než při <acronym title=\"Google Engine Optimization\">GEO</acronym>( viz. <a title=\"Search Engine Optimization na wikipedii\" href=\"http://cs.wikipedia.org/wiki/Search_Engine_Optimization\">SEO</a> ). Odstraněním některých chyb můžete i dosáhnout zvyšení přistupnosti vašich stránek pro uživatele. Informace z nástroje Webmaster Tools si můžete také nechat vypsat na stránce iGoogle( viz. výše ).\n\n### <a href=\"http://www.google.com/analytics/\">Google Analytics</a>\n\nTato služba také slouží vývojářům webových stránek, ale trošku jinak než ta předchozí. Do svých stránek umístíte <a title=\"JavaScript na wikipedii\" href=\"http://cs.wikipedia.org/wiki/Javascript\">JavaScriptový</a> kód a ten ukladá na Google informace o tom jak uživatelé procházejí web. Touto službou získáte informace o návštěvnosti vašeho webu, odkud jeho uživatelé jsou, o co mají zájem a o co nikoliv, atp.\n\n### <a title=\"Stránky služby Google Apps\" href=\"http://www.google.com/a/help/intl/cs/index.html\">Google Apps</a>\n\nGoogle Apps je služba primárně určená pro organizace a školní zařízení. Nabízí <a title=\"Výčet služeb pro Google Apps\" href=\"http://www.google.com/a/help/intl/cs/business/applications.html\">služby společnosti Google pro jednotlivé domény</a>. Můžete pak mít GMail, ale nebudete mít adresu franta.svatohlidek@gmail.com, ale napřiklad franta@svatohlidkovy.cz. Ke své poště pak přistupujete na adrese například mail.svatohlidkovy.cz, nebo mail.mujgang.cz. U verze standard dostanete k dispozici kromě mailu ještě kalendář( Google Calendar ), online office( Google Docs ), chat( Google Talk ). V celku novinkou je možnost si napsat pro svou doménu vlastní aplikaci prostřednictvím <a title=\"Stránky projektu Google App Engine\" href=\"http://code.google.com/intl/cs-CZ/appengine/\">Google App Engine</a>.\nV tomto článku popíši služby a produkty společnosti Google, které nejvíce používám a ty, které mi příjdou nejzajímavější. Pro ty kdo již využívají <a title=\"Web Google.cz\" href=\"http://www.google.cz/\">vyhledávač Google</a> jen podotknu, že v dnešní době již spočnost Google nenabízí jen vyhledávač, ale i <a title=\"Výčet služeb společnosti Google\" href=\"http://www.google.cz/intl/cs/options/\">spoustu jiných služeb</a> a neustále <a title=\"Služby společnosti Google, které jsou zatím ve vývoji, ale již poskytnuty veřejnosti\" href=\"http://labs.google.com/\">přibývají nové</a>."},{"identifier":"Online úložiště/synchronizátory","title":"Online úložiště/synchronizátory","content_blob":"### Jak to funguje\n\nZpůsob fungování těchto služeb je stejný. Nainstalujete si prográmek, který hlídá jestli se něco změnilo ve vybraných adresářích. V praxi to znamená, že si nastavíte složku, kterou má synchronizátor sledovat, něco do ní nahrajete a rázem( v závislosti na velikosti souborů a rychlosti internetového připojení ) je obsah této složky přístupný i online. Při práci se soubory se pro vás nic němění. Prostě kopírujete, mažete, editujete soubory a adresáře. O zbytek se postará synchronizátor.\n\n### DropBox\n\nInstalace probíhá <a title=\"Domovská stránka služby Dropbox\" href=\"http://www.getdropbox.com/\">stažením synchronizátoru ze stránek projektu</a> a následným vybráním složky, která bude synchronizována. Jak vyplívá z předešlé věty, tak DropBox synchronizuje pouze jednu složku a dále její podsložky. Po instalaci je ve zvoleném adresáří automaticky k dispozici složka Photos a Public. Jak nazvy napovídají, tak slouží. Samozřejmě je možné si vytvořit i další složky. Ve verzi free, tedy zdarma, je k dispozici  2GB prostoru, v placené verzi( 99$/rok ) je to 50GB na měsíc vás to stojí desetinu. Pokud je dropbox používán na synchronizaci dokumentů a je mazáno to co již není potřeba, nedokážu si moc představit jak tento prostor zaplnit. Nevýhoda, která vedla mou ruku k odinstalaci deset minut po instalaci, je že jste při uploadování( nahrávání souborů na server DropBoxu ) limitovaní rychlostí 33kb/s. V dnešní době mi to příjde trochu smutná rychlost, zvlášť pokud mají být v synchronizovaném adresáři měněny soubory klidně s jen trošku vetší frekvencí.\n\n### Syncplicity\n\nInstalaci si opět odbydeme <a title=\"Stránky projektu Syncplicity\" href=\"http://www.syncplicity.com/\">stažením synchronizátoru</a> a nastavením adresářů. Synchronizátor je k dispozici pro W a Mac. Co se týče synchronizovaných adresářů, tak na to jde Syncplicity trochu jinou cestou. Při instalaci máte možnost buď nechat instalátorem vybrat složky, které bude synchronizovat( v defaultu to je Plocha, Dokumenty, Oblíbené, Hudbu a Obrázky ), nebo vybrat druhou možnost a ihned po instalaci si vytvořit vlastní složky, které budou synchronizovány se svými online protějšky. Opět je tu verze free a verze placená. Free poskytne 1GB prostoru, což je sice méně než u DropBoxu, ale můžete si přividělat nějaký ten GB tím že budete lovit dušičky( 1 hrníček == 1GB ) pro svého bajtodárce. Placená verze pojme za 99$/rok 50GB + lovení( 1 hrníček == 2GB ) + dalších 50 GB za dalších 99$/rok. Pokud by jste chtěli platit po měsících cena je opět desetinou. Soubor o velikosti 311 MB byl synchronizován za nějakých 30-40 minut  Kromě samotné synchronizace a uchovávní souborů nabízí také provázání na služby\n\n-  [Facebook](http://www.facebook.com/ \"Stránky sociální sítě Facebook\") - synchronizace fotek z uloziste Synplicity do alb fotografíí na facebooku\n-  [Google Docs](http://docs.google.com/ \"Stránky služby Docs společnosti Google\") - Synchronizace dokumentů na online úložišti Syncplicity a Google Docs\n-  [Picnic](http://www.picnik.com/ \"Stránky online rastrového editoru Picnic\") - Editace obrázků na online úložišti Syncplicity\n-  [Scribd](http://www.scribd.com/ \"Stránky webového prohlížeče dokumentů Scribd\") - Prohlížení dokumentů z online úložiště\n-  [Zoho](http://www.zoho.com/ \"Stránky webových služe Zoho\") - online editace dokumentů z úložiště. Jenom podotknu, že ozdíl oproti propojení s GDocs je, že zde se ukládá dokument přímo na úložiště Syncplicity a né na úložiště GDocs\n\n### Live Mesh\n\nSynchronizer jsem stahoval přímo z účtu( po prihlaseni ), uvedu tedy jenom web služby <a title=\"Stránky služby Live Mesh\" href=\"https://www.mesh.com\">https://www.mesh.com</a>. Jak název napovídá jedná se o produkt z dílny nechvalně známé Svým vším. Služba je ve fázi Beta a nabízí zatím jenom jeden neplacený tarif. Kapacita prostoru je 5GB. Co se týče nastavení synchronizovaných adresářů, opět platí, že si můžete vytvořit adresáře kde chcete. Nevím, jestli jsem nevšímavý, ale nikde jsem nenašel složku public, takže je zde nejspíš možnost pouze cíleného sdílení. UI se znaží výpadat na webu stejně jako synchronizátor na desktopu. Po patnácti minutách synchronizace se dokázalo uploadnout \"závratných\" 100MB, což mi nepříjde moc na normální práci se soubory, ale jedná se teprve o provoz v Beta verzi, tak kdo ví jak bude vypadat ostrá verze. Vzhledem k výrobci asi nepřekvapí i volba primárního operačního systému pro který se synchronizátor dá stáhnout. K dispozici je ovšem i jakýsi preview pro mac.\nNelekejte se nadpisu na naší planetu ještě neutočí žádná nová forma života;) <a title=\"Pojem synchronizace na wikipedii\" href=\"http://cs.wikipedia.org/wiki/Synchronizace\">Synchronizace</a> je jinými slovy udržování více věcí ve stejném stavu. Synchronizátor je to co udržuje věci v onom stejném stavu. V tomto postu popíši tři aktuálně( pro mě ) nejzajímavější online úložiště a to DropBox, Syncplicity a Live Mesh."},{"identifier":"Formátování kódu - tabulátory nebo mezery","title":"Formátování kódu - tabulátory nebo mezery","content_blob":"### Pojmy\n\nKlávesa Tab píše buďto znak tabulátoru, nebo v editoru nastavený počet mezer. Nastavení, kdy Tab napíše znak tabulátoru nazýváme hard tab, pokud napíše nastavený počet mezer, je to softtab, nebo také emulovaný tab. Tabulátory a mezery nám slouží k odsazení, či zarovnání, dle užití. Tabulátor a mezera patří do skupiny bílých znaků. Odsazením se rozumí vzdálenost prvního \"černého\" znaku\" z leva( u normálního našince ). Zarovnání pak slouží k zarovnání například parametrů funkce, operátorů, atp, pod sebe.  Tyto pojmy nejsou exaktní fakta. Pouze dávám přiblížení pojmů v následujícím textu. Na černém znaku si samozřejmě trvám;)\n\n### Hardtab\n\nPro použití hardtabu hovoří to, že si každý může nastavit nakolik bude mít text odsazený. Je vkládán pouze znak tabulátoru a jeho interpretace zavisí na editoru - je to interpretovaný znak. To je výhoda i nevýhoda. Výhodou je, že si každý nastaví zobrazení tabulátoru, tak jak mu to vyhovuje. Nevýhodou je, že můžete narazit na editor, který tabulátory nerespektuje, nebo je jen suše zobrazí jako znaky tabulátoru. Další nevýhodou je, že váš kód může potkat nehoda, při které o tabulátory nějakým způsobem příjdete, popřípadě se z nich stanou jiné, jistě velice zajímavé znaky. Mě se to snad ještě nikdy nestalo, ale podle účastníků různých fór jde o vcelku běžný jev.\n\n### Softtab\n\nSofttab - vkládání mezer na místo tabů, je snad nejoblíbenějším způsobem vzdalování kódu od okraje. Jeho zastánci hovoří hlavně o tom, že mezerám se nemůže nic stát. Ať jsem v jakémkoliv editovacím nástroji odsazení je vždy stejné. To je také výhoda i nevýhoda. Nebožák, který ma nevšímavé oko, potřebuje odsazení vetší a už je tu problém. Jenom pro zajímavost, při procházení dokumentačních materiálů k frameworku Symfony jsem narazil na hlášku, že se ve frameworku nepoužívají tabulátory, protože to prostě v editoru <a href=\"http://fabien.potencier.org/\">Fabiena Potenciera</a> vypadá ošklivě.\n\n### Zombietab\n\nExistují i tací, kteří ani nevědí co píší. Jejich Editor prostě odsadí a je jim jedno jak. To je varianta, která by měla být vymícena, nicméně je celkem běžná.\n\n### Závěrem\n\nCo říci závěrem. Jak Softtab, tak Hardtab mají svoje výhody. K přecházení na jinou variantu než je ta, kterou právě používáte je pracné a měl by k němu být dobrý důvod. Samozřejmě pokud používáte Zombietab, tak přejděte okamžíte na kterýkoliv ze dvou výše zmíněných. Celkem zajímavou variantou, kterou jsem na internetu potkal je skloubení Soft a Hard tabu. V této variantě se užívá buďto Hardtabu pro odsazení bloku kódu a Softtab pro zarovnání v rámci bloku a nebo Hardtab pro odsazení veškerého kódu a Softtab pro zarovnání například parametrů ruzných volání fcí pod sebe. Důležitou roli při volbě stylu psaní kódu hraje postoj píšícího k cizímu kódu a editorům. Pokud používá cízí kód, například hotové knihovny, měl by píšící zvolit styl psaní, jaký je běžný v těchto  cizích kódech, jinak narazí na kompatibilitu těchto dvou skupin kódů. Tedy je lepší dodržovat rozšířenou konvenci pro prostředí ve kterém se píšící pohybuje. V odkazech níže si můžete prohlédnou popisy konvencí pro některá prostředí. Druhá věc je, že některé editory, či jiné nástroje mohou chybně interpretovat řídící znaky( tedy i tabulátory ). Ať se přidáte k jakékoliv vývojové skupině, bude chtít aby jste používaly její styl psaní kódu, kvůli verzovacím systémům, kompatibilitě s ostatními vývojáří a tak podobně. Tato skupina má jistě své důvody, pro užití toho, či onoho stylu psání kódu a vy by jste se měly přisbůsobit, nebo jim jejich názor rozumnými argumenty vyvrátit. Pro své kódy samozřejmě užijte co uznáte za vhodné vy.\n\n#### Jak to vidím já\n\nZastávám názor, že je zbytečné znovu vymýšlet kolo a že neexistuje vhodné řešení, ale vhodné řešení pro určitou problematiku. To mě vede k tomu, že když vidím pěknou knihovnu, tak ji použiji a když mi na něco vyhovuje nějaký editor, tak ho na to používám. Primárně píši webové aplikace v php a snad zatím v každém takovém kódu jsem viděl užití mezer( <a href=\"http://phpmailer.svn.sourceforge.net/viewvc/phpmailer/\">phpMailer</a>, <a href=\"http://dotproject.svn.sourceforge.net/viewvc/dotproject/\">dotProject</a>, <a href=\"http://www.mantisbt.org/bugs/plugin.php?page=Source/list&amp;id=7\">Mantis</a> ) pro veškeré vzdalování textu. Ve svých kódech užívám mezer a nikdy jsem neměl problém. Mezery jsou téměř nezničitelné okolními vlivy a budou to vzdycky mezery a ne to pro co se rozhodne editor. Toto mé rozhodnutí mám podpořené konvencemi psaní kódu pro různé jazyky a systémy( viz níže ). Zarovnávání parametrů volání různých fcí používám jed zřidka kdy a když chci zarovnat parametry volání jedné fce( například, když jich má mnoho, nebo jsou dlouhé ) užívám tabulátor, tedy opět mezery.\n\nTato sekce postu by neměla sloužit jako vyznění tohoto článku. Je to pouze příklad jak to dělá jeden člověk a jaké k tomu má důvody.\n\n### Odkazy\n\nTento post je zajímavým doplněním k následujícím odkazům.\n\n- [Odsazování](http://php.vrana.cz/odsazovani.php) - Vránovo pozastavení obecně nad psaním kódu\n- [Coding Standards](http://pear.php.net/manual/en/standards.php) - Standardy psaní kódu pro <abbr title=\"PHP Extension and Application Repository\">PEAR</abbr>\n- [Linux kernel coding style](http://www.kernel.org/doc/Documentation/CodingStyle) - Dokumentace ke psaní kódu pro linuxové jádro\n- [Style Guide for Python Code](http://www.python.org/dev/peps/pep-0008/) - Dokumentace k psaní kódu v jazyce Python. U jazyka Python a jemu podobných je otázka odsazování velice důležité, jelikož zde má funkční význam. Je zde totiž použito pro vytváření sub-bloků. Například těl podmínek, metod, tříd a tak podobně\n- [YAML](http://www.yaml.org/spec/current.html#id2519916) - Část specifikace toho serializačního jazyka pojednávající o odsazování\n\nTento post pojednává o nekonečném tématu – odsazování zdrojového kódu při psaní. Psát kód jenom podle  svého přesvědčení mi přijde naprosto zcestné a proto jsem si vzal na pomoc ten Internet, když vo ňom všichni tak básněj. Post je tedy spíše souhrnem informací a názorů, které jsem našel, občasně doplněný názory mými."},{"identifier":"Youtube do mp3","title":"Youtube do mp3","content_blob":"### 1. Získání videa\n\nAby se dalo vedeo zkonvertovat do mp3 musíme si ho stahnout do svého počítače. K tomu nám poslouží stránka <a href=\"http://keepvid.com/\">keepvid.com</a>. Do jediného políčka na stránce vložíme adresu na které se na chtěné video díváme na youtube. Stránka chvíli zahrabe a pak nám nabídne dva odkazy ke stažení námi chtěného videa. Je jedno, který zvolíme. Odkaz na soubor mp4 MŮŽE mít lepší kvalitu. Stáhneme někam, kde pak video  snadno najdeme.\n\n### 2. Konverze videa\n\nOsobně dávám přednost nástrojům, kde si přesněji navolím co má dělat, ale pro jednochost postupu sáhnu po prográmku <a href=\"http://www.winff.org/\">WinFF</a>. Video, které jsme si v minulém kroku uložili do WinFF načteme tlačítkem + Add. Nyní Zvolíme na co chceme  převádět. V kolonce popsané Convert to... zvolíme Audio a jako Device preset zvolíme MP3. V poli Output Folder máme, nebo bychom alespoň meli mít cestu, kam se nám uloží. Nýní, když stiskneme tlačítko Convert. Vykočí nám okno s haldou písmen. Jejich význám znát pro to co děláme nepotřebujeme. Až bude vše hotovo na konci haldy písmen se objeví výzva, abychom cokoliv stiskli pro pokracovani. Nyní, pokud šlo vše dobře, již máme v námi zvoleném adresáří( Output folder ) hotovou mp3jkou\nČas od času  se mě kamarádky ptají jak dostat video z Youtube do mp3, aby to mohli poslouchat ve svych chytrych krabickach. Tady je tedy post, ktery to popisuje."},{"identifier":"Kudy tudy z ICQ na Jabber","title":"Kudy tudy z ICQ na Jabber","content_blob":"### 1. Účet\nPrvní krok je zřídit si Jabber účet. To probíha většínou přímo z klienta. Některé servery umožňují i registraci na webu. Ze serverů u nás je na výběr <a title=\"Jabbim\" href=\"http://www.jabbim.cz/\" target=\"_blank\">Jabbim</a>, <a href=\"http://www.root.cz/specialy/jabber/\" target=\"_blank\">Root</a>, a o něco se snad i pokouší Seznam.cz, officialni link na Jabber sem nenašel. Jistě je přehršel jiných Jabber serverů. Tyto vyjmenované jsou prostě v mém povědomí navrchu, tak jsem je nejsnáze vylovil;)\n\n### 2. Klient\n#### 2.1 Web\n\nJednou možností je si spustit si webového klienta. Takového nabízí například <a title=\"Jabbim JWChat\" href=\"http://www.jabbim.cz/jwchat/\" target=\"_blank\">Jabbim</a> (PHP), či <a title=\"Root Java Client\" href=\"http://www.root.cz/bin/jabber-applet/jeti.html\" target=\"_blank\">Root</a> (JAVA).\n\n#### 2.2 Desktop\n\nNo to aby jste mohli pohodlně komunikovat přes Jabber měli by jste si stáhnout klienta. Jedná se o aplikaci, která běží přímo na vašem počítači. Z nejoblíbenějších uvedu například <a title=\"Odkaz na stránky klinta Psi\" href=\"http://psi-im.org/\" target=\"_blank\">Psi</a>, <a href=\"http://www.miranda-im.org/\" target=\"_blank\">Mirandu</a>, <a href=\"http://www.jabber.cz/wiki/Jabbim_(klient)\" target=\"_blank\">Jabbim</a> (od serveru Jabbim), <a href=\"http://www.pidgin.im/\" target=\"_blank\">Pidgin</a> a <a href=\"http://adium.im/\" target=\"_blank\">Adium</a>\n\n##### 2.2.1 Psi\n\nJedná se o klienta výhradně pro protokol Jabber/XMPP. Nabízí střídmé portfolio možností a akcí, které uživatel provadí.\n\n##### 2.2.2 Miranda\nMiranda je oblíbená spíše u pokročilejších uživatelů. Klient umí základní věci a zbytek se dá doinstalovat skrze rozšíření, či donastavit přes vcelku vyčerpávající možnosti nastavení. Tyto dvě věci jsou výhodou i nevýhodou klienta. Předpokládám, že běžný uživatel chce nainstalovat a jet. Pokud si chce uživatel vyšperkovat klienta jak chce, tak je to pro něj samozřejmě výhoda. Klient v základu nabízí protokoly Jabber/XMPP, ICQ, atp. Tento klient je určen pro platformu MS Windows\n##### 2.2.3 Jabbim\nJedná se o klienta z dílny serveru Jabbim, který poskytuje stejnojmený Jabber server. Jako takový je vhodný pokud chcete pohodlně používat služby tohoto serveru.\n##### 2.2.3 Pidgin\nJedná se o jednoduchého klienta rozšiřitelného přes pluginy. Neomezuje se pouze na Jabber/XMPP, ale podporuje mnohem více protokolů.\n##### 2.2.3 Adium\nJedná se o multiprotokolového IM klienta. Mnoho toho o něm nevím a uvádím ho jenom pro zastoupení platformy MacOS\n\nKromě Mirandy a Adia jsou výše zmínění multiplatformní. Pokud tedy máte dualboot můžete užívat na obou systémech stejného klienta.\n\n### 3. Transport\nTransport je v protokolu Jabber/XMPP služba, která vám přes Jabber účet umožní se přihlásit a komunikovat i v jiných sítích. Záleží pouze na serveru, na který se přípojujete, jaké transporty vám dá k dispozici. Začít používat nějaký transport můžete přes Prohlížeč služeb ve vašem klientovi. Pokud tedy přecházíte z ICQ, najdete si transport do sítě ICQ.\n\nTakže teď už máme Jabber účet se kterým se přihlásíme ve svém klientovi a máme zaregistrován transport do sítě ICQ. Pokud chcete z ICQ odejít a čekáte na ostatní, tak vám silně doporučuji si nepřidávat nové kontakty z této sítě. Pokud chcete odejít skokově, tak například Jabbim nabízí službu, která \"sedí\" na vašem ICQ účtu a lidem kteří vám na něj píší odpoví, že jste přešli na Jabber a jak je možné vás kontatkovat.\n\nDofám, že pro vás byl čas u tohohle postu přínosem a těším se u dalšího postu\nSpousta lidí mi říká( když pominu ty, kteří jabber nechtěji, protože klienti jsou jinak barevní, klasické ICQ ), že by klidně přešlí, ale že mají na ICQ tolik lidí, že přechod na cokoliv jiného je nemožný. Funguje to stejně jako přesun skupiny lidí do jiné hospody - jamile se dav zvedne, tak se de, ale do té doby se nestane nic. Dnes se podíváme jak jít blíž ke dveřím a počkat až se zvednou ostatní."},{"identifier":"SVN v Netbeans","title":"SVN v Netbeans","content_blob":"Předesílam, že integrací <abbr title=\"Subversion\">SVN</abbr> do <abbr title=\"Netbeans\">NB</abbr> nezískáte <abbr title=\"Snowboard\">SNB</abbr>. Instalace probíha dvěmi cestami. K oběma dojde přirozenou cestou. Ve chvíli kdy chcete něco checkoutnou a nemáte nainstalovaný Subversion, NB se po něm začnou ptát. Nabídne vám dvě možnosti.\n\n### 1) Nainstalovat bundle NB\nProstě se stáhne balík, který se nainstaluje a restartují se NB a po startu již máte k dispozici SVN v NB\n\n### 2) Navést NB k binárce SVN.\nTuto možnost zvolte, pokud chcete SVN používat i mimo NB a máte již stažené <a title=\"Stránky pro downloadu SVN\" href=\"http://subversion.tigris.org/\" target=\"_blank\">binárky SVN</a>. Vhodné pro konzolisty, kteří nevěří zbytečným GUI a složitější operace si radši udělají ručně v konzoli a ty jednodušší svěři rozhraní v NB\n\nJak tedy provedete onen první checkout? Tato akce se skrývá v nabídce Team=&gt;Subversion=&gt;Checkout. Checkout nám nabízí kromě jiného také možnost detekovat adresář s projektem NB. Nemusíme pak tedy nic nastavovat a NB a máte založený projekt. Druhou příjemnou věcí je, že v prvním kroku checkoutu nám stačí zadat jenom adresu repositáře. V druhém kroku pak můžeme vybrat přesnou větev k checkoutu přes repository browser.\n\nTak jsme tedy checkoutly a udělaly nějakou tu změnu a teď bychom rádi commitly změny. Ale co to? Byly jsme tak činí, že jsme udělaly práci obsaženou v osmi ticketech. Pokud chceme commitnout naší práci na vícekrát máme opět dvě možnosti. Při rozbalení kontextové nabídky projektu najdeme pod Subversion položku commit. Otevře se dialogové okno pro commit. Nabízí velké textové pole pro log message commitu a pod ním seznam souborů které commitujete. My jsme toho dnes udělaly až příliš, takže něco commitovat nebudeme. U každé změny můžeme buď nechat defaultně vybraný Add as test, Add as binary, nebo exclude commit, pokud nechceme daný soubor vůbec commitnou. My budeme commitovat po ticketech a v prvních dvouch commitech bude souborů, které nechceme commitnout většina. Proto provedeme commit druhou cestou. Z kontextové nabídky projektu si v SVN najdeme show changes. Po kliknutí se nám zobrazí ve spodní části NB seznam změn, které jsme udělaly. Zde vybereme soubory, které chceme commitnout a tuto akce pak nad výběrem proveme z kontextové nabídky. Otevře se nám již známé dialogové okno pro commit. Vídíme zde, že opravdu commitujeme soubory, které jsme vybraly.\n\nDále můžeme v kontextové nabídce projektu/adresare/souboru v SVN vytvořit novou větev - Copy to - udělá se commit do složky v repositáří zvolené v nabídnutém repo browseru. Také se můžeme do nějaké větve přepnout - Switch to copy - opět s repobrowserem. Třetí hlavní možností je merge - také s repo browserem\nA je to tady. Slibovaný článek o Subversionu v Netbeans je tu. Pokusím se popsat možnosti jaké nám Netbeans nabízí pro Subversion. Soustředit se budu na každodení úkony. Tento post předpokládá, že již znáte základní pojmy SVN a trochu se orientujete v Netbeans. Popisovat budu možnosti v aktualní verzi 6.8"},{"identifier":"Google Apps","title":"Google Apps","content_blob":"### Jak to funguje\n\nU společnosti Google si zaregistrujete učet pro vaši doménu. Ve chvíli registrace učtu na google.com by neměla být nutná její existence, ale je samozřejmě lepší mít již doménu pro kterou Google Apps( GA ) zamýšlíte zaregistrovánu. Nikdy nevíte, jestli vám ji někdo \"nevyfoukne před nosem\". V administraci své domény si změníte nebo přidáte zaznámy <a title=\"DNS na wikipedii\" href=\"http://cs.wikipedia.org/wiki/DNS\">DNS</a>( popíšu dále ).\n\n### Doména\n\nJako první je potřeba mít svoji doménu druhého řádu( např. suchar.cz ). Tu si zařídíte u registrátora domén( např <a title=\"Registrace domén na FORPSI\" href=\"https://www.forpsi.com/domain/\">forpsi</a> ), nebo vám registraci domény zařídí firma, u které si zaregistrujete <a title=\"Webhosting na wikipedii\" href=\"http://cs.wikipedia.org/wiki/Webhosting\">webhosting</a>( <a title=\"Firma nabízející webhosting\" href=\"http://www.cesky-hosting.cz/\">Česky Hosting</a>, <a title=\"Fima nabízející webhosting\" href=\"https://www.onebit.cz/\">ONEbit</a>, <a title=\"Firma nabízející webhosting\" href=\"http://www.profitux.cz/\">Profitux</a> ). Jenom podotknu, že webhosting jako takový pro Google Apps mít nemůsíte. K provozování GA pouze potřebujete mít dříve zmíněnou doménu druhého řádu a přes ní budete( po správném nastavení DNS ) přistupovat ke Google službám k vaší doméně\n\n### <a title=\"Registrace učtu pro Google Apps\" href=\"http://www.google.com/a/cpanel/domain/new?hl=cs\">Registrace na Google.com</a>\n\nZde o sobě vyplníte pár základních údajů a budete muset nechat google ověřit, že vám doména opravdu patří. To probíhá nahráním souboru se specifickým jménem a obsahem. Průvodce registrací provede naprosto jednoduše a \"bezbolestně\".\n\n### Nastavení DNS\n\nV jádru jde o to říci ve svých DNS záznamech, že pokud někdo chce tu a tu službu, tak se má obrátit na ten a ten server. Tedy když se budu držet dřívějších příkladů, že pokud někdo příjde na adresu mail.suchar.cz, má se tímto požadavkem zabývat server Googlu.\n\nAsi nejsnažší konfigurace DNS pro služby GA, kterou jsem si zatím prošel byla na webhostingu ONEbit. Samozřejmě, že si nastavíte GA pro každou doménu u které můžete měnit záznamy DNS, ale zde máte k dispozici šablonu, která to usnadní a vy si pak už jenom přidávate záznamy pro subdomény/jednotlivé služby.\n\nVýsledné nastavení pak vypadá nějak takto:\n\n#### CNAME záznamy - odkazování na služby\n\n<table border=\"0\">\n<tbody>\n<tr>\n<td>calendar.suchar.cz</td>\n<td>ghs.google.com</td>\n<td>3600</td>\n</tr>\n<tr>\n<td>docs.suchar.cz</td>\n<td>ghs.google.com</td>\n<td>3600</td>\n</tr>\n<tr>\n<td>mail.suchar.cz</td>\n<td>ghs.google.com</td>\n<td>3600</td>\n</tr>\n<tr>\n<td>moderator.suchar.cz</td>\n<td>ghs.google.com</td>\n<td>3600</td>\n</tr>\n</tbody></table>\n\n#### MX záznamy - pošta\n\n<table class=\"dns-rcs\" border=\"0\">\n<tbody>\n<tr>\n<th>Doména</th>\n<th>Cíl</th>\n<th>TTL</th>\n<th>Priorita</th>\n</tr>\n<tr>\n<td><strong>suchar.cz</strong></td>\n<td>ASPMX.L.GOOGLE.COM</td>\n<td>3600</td>\n<td>1</td>\n</tr>\n<tr>\n<td><strong>suchar.cz</strong></td>\n<td>ALT1.ASPMX.L.GOOGLE.COM</td>\n<td>3600</td>\n<td>5</td>\n</tr>\n<tr>\n<td><strong>suchar.cz</strong></td>\n<td>ALT2.ASPMX.L.GOOGLE.COM</td>\n<td>3600</td>\n<td>5</td>\n</tr>\n<tr>\n<td><strong>suchar.cz</strong></td>\n<td>ASPMX2.GOOGLEMAIL.COM</td>\n<td>3600</td>\n<td>10</td>\n</tr>\n<tr>\n<td><strong>suchar.cz</strong></td>\n<td>ASPMX3.GOOGLEMAIL.COM</td>\n<td>3600</td>\n<td>10</td>\n</tr>\n<tr>\n<td><strong>suchar.cz</strong></td>\n<td>ASPMX4.GOOGLEMAIL.COM</td>\n<td>3600</td>\n<td>10</td>\n</tr>\n<tr>\n<td><strong>suchar.cz</strong></td>\n<td>ASPMX5.GOOGLEMAIL.COM</td>\n<td>3600</td>\n<td>10</td>\n</tr>\n</tbody></table>\n\nV žádném případě nebuďte nervózní, pokud vše nebude hned fungovat. Hostingy většinou provádějí aktualizaci DNS záznamů jednou za nějaký časový interval.\nGoogle Apps je službou, která umožňuje mít služby společnosti Google pro svojí doménu. Nemáte už pak například mail na emil.suchar@gmail.com, ale například emil@suchar.cz( mailem to nekončí ). V tomto článku popíši jak to zhruba funguje a jak si Google Apps zřídit."},{"identifier":"SSH na Windows","title":"SSH na Windows","content_blob":"### K čemu je to dobré\n\nTento postup vám zpřístupní příkazovou řádku vašeho systému a to odkukoliv kde máte s sebou svůj klíč (viz. níže). Také slouží jako cesta pro <abbr title=\"Distributed Version Controll System\">DVCS</abbr>, ale o tom až jindy\n\n\n### Jak to funguje\n\nNa počítači vám běží program, který zpřístupňuje vaši příkazovou řádku přes ssh protokol. Vy se akorát musíte přihlásit předem stanoveným způsobem.\n\n\n### Co budeme potřebovat\n\n-  systém s windows\n-  freeSSHd - <a href=\"http://www.freesshd.com/freeSSHd.exe\">http://www.freesshd.com/freeSSHd.exe</a>\n-  PuTTY - <a href=\"http://the.earth.li/~sgtatham/putty/latest/x86/putty-0.60-installer.exe\">http://the.earth.li/~sgtatham/putty/latest/x86/putty-0.60-installer.exe</a>, nebo si <a href=\"http://www.chiark.greenend.org.uk/~sgtatham/putty/download.html\">vyberte</a>\n\n### freeSSHd\n\nBěhem instalace nejsou žádné záludnosti, takže popíši jen jeho nastavení. Snad jen doporučím, že jestli se jedná o osobní počítač, tak neinstalujte jako freeSSHd jako službu.\n\nPo spuštění je běžící instance reprezentována systray ikonou (nabídka pravým tlačítkem). Pro nás nejduležitější karty nastavení jsou Autentication a Users. V autentication si nastavíme kde budeme skladovat veřejné klíče a zda je budeme používat. Soubor veřejného klíče by se měl jmenovat stejně jako uživatel ke kterému klíč přísluší. V users pak vytvoříme uživatele, který se bude přihlašovat. Pokud chceme používat autentizaci přes klíče (a to my v tomto postu chceme;) ) nastavíme při vytváření uživatele Authorization na Public key... Pozor při ukládání voleb. V hlavním okně nestačí dat pouze Apply, ale musíme dat Ok, protože až tehdy si ssh server opravdu načte naše nové volby.\n\n### PuTTY\n\nPuTTY je sada nástrojů pro práci se spojeními přes SSH atp. My z této sady použijeme PuTTYgen, PuTTY a Pageant.\n\n#### PuTTYgen\n\nJedná se o nástroj pro práci s klíči. My ho použijeme pro vygenerování svých klíčů určených na autentizaci SSH serveru.\n\nTlačítkem Generate v Actions dáme klíč generovat. Jako pseudo náhodná data pro generování klíče vyžívá PuTTYgen pohyb myši. Takže jakmile dáte generovat, tak můžete jít zkouknout Novinky a po nějaké té chvíli hýbání myší máte klíč vygenerován. Doporučuji nastavit si i passphrase, což je takové heslo na které budete vždy při pokusu o použití privátního klíče požádání.V horní části je vypsán veřejný klič. Ten vložte do souboru v adresáří, který je nastaven v freeSSHd jako skladiště veřejných klíčů. Jenom ještě jednou zopakuji, že soubor by se měl jmenovat stejně jako uživatelské jméno pro které je určen. Ve spodní části Actions si poukládejte zbylé klíče.\n\n#### PuTTY\n\nNyní si otestujeme naše spojení. Do pole hostname dáme localhost ( počítač na kterém právě děláte ) a klikneme na open. Otevře se nám okno se session a po chvilce výzva na zadání uživatelského jména. Ale co to?! Ona se potom zobrazí i výzva k zadání hesla. Vždyť jsme zvolily autentizaci přes klíče\n\n#### Pageant\n\nTento hodný prográmek se nám stará o klíče a hesla k nim. Námi vygenerovaný klíč mu dáme z kontextové nabídky systray ikony přes položku Add. Objeví se dialogové okno pro nalezení klíče. Jedná se o ppk klíč, tedy soukromý. Po jeho přidání ještě budeme požádáni o heslo ke klíči pokud jsme ho zvolili. Pokud vše proběhlo tak jak má, tak by jste se nyní měli přes putty přihlásit pouze uživatelským jménem a zbytek udělá Pageant.\n\n### TIP\n\nPokud jste zvyklí vzdaleně pracovat s Linuxovým/Unixovým systémem, tak doporučuji nainstalovat si ještě <a href=\"http://gnuwin32.sourceforge.net/\">GnuWin32</a>. Jedná se o sadu prográmků, které se běžně v těchto prostředích vyskytují, zkompilovaných pro běh ve windows.\nV tomto silvestrovskem postu( posledni v roce 2009 ) popíšu rozjetí ssh na windows s autentizaci přes klíče."},{"identifier":"Git pres ssh na Windows","title":"Git pres ssh na Windows","content_blob":"### \"Vo co tady jako de?!\"\n\nGit - decentralizovaný systém pro správu verzí. Jiné jsou například Mercurial, Bazaar, či Subversion (!svn je centralizované! uvádím ho jen pro jeho rozšířenost)\nSSH - Secured SHell. Slouží pro vykonávání příkazů na počítačí přes zabezpečené spojení\n\nGit obstarává práci s repozitáři a to přes zabezpečené spojení v případě, že použijeme například SSH. Na fungování takového spojení ho nejdřive musíme vytvořit. V tomto postu budu používat sadu prográmků z toolsetu <a href=\"http://putty.very.rulez.org/download.html\">PuTTY</a>.\n\nV tomto postu budu také přepokládat, že git je na serveru zpřístupněn přes gitosis a to pod uživatelem git. Nastavení, či instalaci gitosis jako takového tento post nepokrývá.\n\n### SSH Klíč\n\nCo budeme potřebovat úplně nejdříve je SSH klíč, kterým nás server na kterém je kýžený repositář bude identifikovat. Použiji k tomu PuTTYgen ve verzi release 0.60. Jenom upozorním, že popisky políček a tlačítek se nejspiše mení s jazykovou mutací PuTTYgenu, kterou používáte, ale mělo by se jednat o překlad slov která zde uvádím.\n\nPokud úplně dole v <em>Parameters </em>-&gt; <strong>Type of key to generate</strong> není zvolen typ SSH-2 RSA, tak ho zvolte. Pokud zvolen je, zvolte ho ještě víc;) Zvolit tento typ klíče je celkem důležité.\n\nKliknutím na tlačítko <strong>Generate</strong> se počne generovat klíč.\n\nText v políčku <strong>Key comment</strong> vás bude identifikovat na serveru, takže vyplňte něco co se dobře čte a je pokud možno jedinečné. Já v příkladu zvolil <em>mailo@theWMachine</em>\n\n**Key passphrase**: Toto políčko je vlastně takové vaše heslo vygenerovaného klíče. Bude potřeba zadat pokaždé, když budete chtít klíč použít. Upozorňuji, že to není důvod k tomu toto políčko nevyplňovat, ale právě naopak. Já v příkladu zvolil passphrase <em>heslo</em>.\n\n#### Ukládáme klíče\nToolset PuTTY používá z mě naprosto neznámého důvodu několik druhů klíčů. Z tohoto důvodu uložte co můžete. Tzn tlačitko Save public key, Save private key, Conversions -&gt; Export OpenSSH key, Conversions-&gt; Export ssh.com key.\n\nVšechny klíče ukládejte do &lt;<em>domovský adresář</em>&gt;\\.ssh. Domovský adresář je při standartní konfiguraci na systémech W.. XP v adresáři \\Documents and Settings\\&lt;<em>jméno uživatele</em>&gt;. Na systémech W... Vista \\Users\\&lt;<em>jméno uživatele</em>&gt;. Jako <em>jméno uživatele</em> beru uživatele systému W.. pod kterým budete klíče používat.\n\nTlačítkem Conversions -&gt; <strong>Export OpenSSH key</strong>  uložte klíč pod názvem <em>id_rsa</em>\n\nTlačítkem <strong>Save public key</strong> uložte klíč pod názvem <em>public</em>\n\nTlačítkem <strong>Save public key</strong><em> </em>(ano podruhé to samé tlačitko)<em> </em>uložte klíč pod názvem <em>id_rsa.pub</em>\n\nTlačítkem <strong>Save private key</strong> uložte klíč pod názvem <em>private.ppk</em>\n\nZbytek ukládání dle libosti;)\n\nTeď příchází krok, který nejde tak úplně udělat přímo v PuTTY Key Generatoru. Asi je vám divné proč jsme dvakrát klikali na to samé tlačitko a napodruhé volili jiný název souboru. Bylo to jenom proto, abychom nemuseli ručně soubor s tímto názvem vytvářet. Otevřete tedy nyní soubor s názvem id_rsa.pub v nějakém textovém editoru (ne, MS Word není textový editor) přinejhořším v notepadu, který by měl být na každé verzi W... Obsah tohoto souboru nahraďte obsahem z políčka <em>Public key for pasting into OpenSSH authorized_keys file</em>. Soubor uložte (<strong>velice důležité</strong>) a editor zavřete (volitelné).\n\n#### Jak se můj klíč dostane na server s repozitářem?\n\nNyní je potřeba předat klíč administrátorovi repozitářů se kterými chcete pracovat. Administrátor potřebuje <strong>ssh public key</strong>. Jiný mu nedávejte i kdyby vám vyhrožoval. Jedná se o klíč v souboru <strong>id_rsa.pub</strong>. Tento klíč můžete bezstarostně šířit mezi svými znamými. To co vás od nich odlišuje je, že máte privátní klíč. Řekl bych, že každý administrátor uvítá, když mu pošlete celý soubor a ne jenom jeho obsah.\n\n### Otestování spojení\n\nAž se k vám dostane zpráva, že to již můžete zkusit, tak přichází na řadu další nástroj z toolsetu PuTTY a to nástroj Pageant.\n\nPageant je hodná tray icona s kloboukem, která se nám postará o práci s naším pracně vygenerovaným klíčem. Spusťte nástroj Pageant a k trayikonám (ty srandovní obrázky u hodin vpravo dole) vám přibude obrázek počítače s kloboukem. Klikněte na něj pravým tlačitkem a v nabídce klikněte na <strong>Add key</strong>. Nyní zvolte námi vygenerovaný klíč pro PuTTY. Je to ten s příponou ppk. Budete dotázaní na heslo. To zadejte a kliknete na tlačitko Ok. Nyní znovu klikněte pravým tlačitkem na počítač s kloboukem, ale nyní v nabídce klikneme na New Session. Jediné co je zde potřeba vyplnit je políčko <em>Host Name (or IP address)</em>. Zadejte adresu serveru na kterém jsou tolik chtěné repositáře. Ve spodní části okna vyberte <em>Close window on exit: <strong>Never</strong></em>. Klikněte na <strong>Open</strong> ve spodní části okna nástroje PuTTY. Otevře se okno s černým obsahem a po chvili budete vyzváni k zadání uživatelského jména. Zadejte git a stiskněte Enter. Pokud nebudete dotázáni na heslo, tak je vše tak jak to chceme. Systém na který se připojujete může vrátatit chybu podobnou následující\n\n    login as: git\n    Authenticating with public key \"mailo@theWMachine\" from agent\n    Server refused to allocate pty\n    ERROR:gitosis.serve.main:Need SSH_ORIGINAL_COMMAND in environment.\n\nTo je v naprostém pořádku a nemusíte se tím znepokojovat. Jediné co nás v tuto chvili může vyvést z míry je, když se nás systém zeptá na heslo.\n\n#### Konečně Git\n\nNyní již konečně můžeme pracovat s Gitem. Ja jsem se v gitosis pridal k projektu test, takže ho teď zkusím naklonovat (něco zhruba, trochu, velice málo podobného checkoutu v Subversionu):\n\n    ##CENSORED##>git clone ssh://git@##CENSORED##/test\n    Initialized empty Git repository in ##CENSORED##/test/.git/\n    The authenticity of host '##CENSORED##' can't be established.\n    RSA key fingerprint is ##CENSORED##.\n    Are you sure you want to continue connecting (yes/no)? yes\n    Warning: Permanently added '##CENSORED##' (RSA) to the list of known hosts.\n    Enter passphrase for key '##CENSORED##.ssh/id_rsa':\n    remote: Counting objects: 9, done.\n    remote: Compressing objects: 100% (3/3), done.\n    remote: Total 9 (delta 0), reused 0 (delta 0)\n    Receiving objects: 100% (9/9), done.\n\nVe vašem případě by se nemělo zobrazovat <em>##CENSORED##</em>, ale nějaké konkrétní adresy;)\n\nTo je k rozběhání Gitu pres SSH na W... vše. Doufám, že vám vše funguje tak jak chcete a že jste cely postup ve zdraví přežily. Pokud máte pocit, že v postu něco schází, nebo jste našli chybu, neváhejte mi to prosím sdělit v komentářích.\nV tomto postu popíši rozjetí toho co píši v nadpisu a zároveň uvítám čtenáře v novém roce 2010. Omlouvám se za to sproste slovo v nadpisu, začinajicí na W, ale okolnosti si to žádají. Zjistil jsem, že nejeden vyvojař u kterého dokonce hrozí, že dosáhne vysokoškolského vzdělání, které jej bude identifikovat jako IT specialistu, není sto rozjet git přes ssh na Windows (myslím tím tu klientskou část). Proto jsem se jal tuto exotiku vyzkoušet na vlastní kůži."},{"identifier":"Git - co to je a co s tÃ­m","title":"Git - co to je a co s tÃ­m","content_blob":"[Git](http://git-scm.com) je <a href=\"http://en.wikipedia.org/wiki/Distributed_version_control_system\"><abbr title=\"Distribuovaný/Decentralizovaný Systém pro Kontrolu Verzí\">DVCS</abbr></a>. Jako takový nevyžaduje pro své fungování, žádný server. Repozitář máte celý u sebe. To je výhoda, ale některé lidi to zkrátka děsí. Většina obav plyne z objemu dat, které musí mít vývojář u sebe. Vetšinou se ale jedná o necelou velikost pracovní kopie navíc. To neznamená pouze, že můžete pracovat i bez připojení k serveru, ale také že je většina opearací rychlejší, protože se nic nepřenáši po síti, ale pouze se čte z disku.\n\nDalší věc která vyplívá z distribuovatelnosti je rozhození čísel revizí. V systému Git se spíš než pojem revize používá pojem changeset. Jedná se o sadu změn, kterou jste provedli při jednom commitu, nebo jeho doplnění (git commit --amend). Takový changeset je identifikován hashem SHA-1. Tento hash je tvořen právě změnami, které jste provedli.\n\nSpolupráce mezi vývojáři probíhá buďto přes centrální server, nebo přes souborový systém. V případě serveru je to buďto nějaký váš server. Pokud takový nemáte můžete využít nějaký z veřejně provozovaných. Uvedu například <a href=\"http://github.com/\">github</a>, <a href=\"http://gitorious.org/\">Gitorious</a>, <a href=\"http://repo.or.cz/\">repo.or.cz</a>. Autentizace probiha přes ssh klíče a vy vlastně čtete soubory pres ssh. Nedávno jsem publikoval posty <a href=\"http://www.rooland.cz/system/2010/03/31/git-pres-ssh-na-windows/\">Git pres ssh na Windows</a> a  <a href=\"http://www.rooland.cz/komunikace/2009/12/ssh-na-windows/\">SSH na Windows</a>. Ty vám mohou pomoci při rozjíždění kolaborace s jinými vývojáři. Celkem pěkně je postup zpracován také na <a href=\"http://help.github.com/msysgit-key-setup/\">Githubu</a>.\n\n### Základní workflow\n#### Zapojení se do existujícího projektu\n\nJako první si musíte repozitář stáhnout k sobě. V systému git se této operaci říká Klonování:\n\n    git clone git://github.com/git/hello-world.git\n\nProvedete nějaké zmeny a commitnete je:\n\n    git add .\n    git commit\n\nPri commitu se systém git chová trochu jinak než třeba svn. Commit v systému git necommituje automaticky všechny změny, ale akorát ty co mu řeknete. git add přidá všechny změny ke commitnutí. Pokud by jste pouzily prikaz <em>git add surface.c</em> budou commitovány pouze změny v souboru surface.c. Nutno dodat že soubor bude commitován ve stavu při kterém jste použily <em>git add</em>. Pokud nechce používat staging (pripravovani ke commitu), můžete přidat příkazu commit přidat parametr -a:\n\n    git commit -a\n\nTakhle git commitne všechny změny.\n\nTakhle můžeme udělat třebas 20 commitů a teprve až potom nahrát změny na server, či kolegovi. V systému git se používá pojem push.\n\n    git push\n\nBez parametrů git pushuje na server origin. To je v tomto případě server ze kterého jste klonovaly.\n\n#### Vytvoření a zveřejnění projektu\n\nVerzovaný adresář vytvoříme v systému git příkazem init v adresáři projektu a přidáním jeho obsahu k verzování:\n\n    git init\n    git add .\n\nZbytek je stejný jako v předešlé části až do pushe. Tady nebude git vědět co po něm chcete, protože projekt nenese informaci o žádném jiném repositáři. Ta se přidává přikazem remote.\n\n    git remote add origin git://github.com/git/hello-world.git\n\nStejně by jste si klidně mohly přidat repozitář kolegy Petra\n\n    git remote add petr git://github.com/git/hello-world.git\n\nV tomto případě by asi adresa byla jiná, ale radši jsem použil existující repozitář. Při pushi k Petrovi byto pak bylo:\n\n    git push petr\n\n\n### Grafické nástroje\n\nSoučástí instalace Gitu jsou i nástroje gitk a git-gui. Oba se spouští v adresáři, který je verzovaný systémem pro správu verzí Git.\n\nGitk je nástroj pro prohlížení historie projektu. Zobrazí vám graf historie, jak se větve mergeovaly. Jednotlivé changesety s jejich podrobnymi informacemi, pokud na nejaky kliknete.\n\nGit-gui je grafická nadstavba nad příkazy systému git. Umožní vám pohodlně commitovat, stageovat a tak podobně.\n\n### Závěrem\n\nTo je k základnímu workflow vše. Pokud by vás zajímaly složitější postupy, tak napište do komentářů a můžeme se sejít u dalšího postu na podobné téma;) Dále také můžu vřele doporučit knihu Pro Git, která je volně k dispozici (<a href=\"http://progit.org/\">http://progit.org/</a>). Kniha také vyšla v češtine od cz.nic - <a href=\"http://knihy.nic.cz/\">http://knihy.nic.cz/</a>, kde je také k volně dispozici v češtině a zároveň si ji můžete koupit, pokud dáváte přednost papíru. Anglický originál jsem nečetl, ale v českém vydání se informace trochu rozcházejí s jinými zdroji dokumentace. Nejdená se však o nějaké velké odlišnosti, kvůli kterým by jste neměli být schopni se systémem pracovat.\nV tomto postu popíšu takový základ fungování gitu a příkazy, které použijete při práci nejčastěji."},{"identifier":"Externí monitor na notebooku s Ubuntu","title":"Externí monitor na notebooku s Ubuntu","content_blob":"### Relevantní konfigurace\n\n* **Notebook:** NB ASUS M50VC-AS001C 15.4C T8400 DVDRW 320G 4G W B FP VHP\n* **Systém:** Ubuntu&nbsp;10.10&nbsp;Maverick&nbsp;Meerkat( `Linux kazimir 2.6.35-24-generic-pae #42-Ubuntu SMP Thu Dec 2 03:21:31 UTC 2010 i686 GNU/Linux` )\n* **Grafická karta:**&nbsp;NVIDIA GeForce 9300M G (&nbsp;DSUB/VGA&nbsp;)\n* **Externí monitor:**&nbsp;BENQ FP91G+ ( DVI + DSUB/VGA )\n* **Manažer desktopu:**&nbsp;GDM 2.30.5\n* **X server:**&nbsp;xorg-server 2:1.9.0-0ubuntu7.1\n\n\n### Schéma nastavení\n\nCelé nastavení se odehrává v souboru&nbsp;/etc/X11/xorg.conf. Schéma nastavení v tomto souboru je zhruba následující. Jednotlivé komponenty nastavení jsou každá ve své sekci( `Section` ). Celé složení toho co vídíme po spuštění grafického systému se nachází v sekci `ServerLayout`.\n\nV ServerLayout je popsáno z čeho se to co vidíme skládá a název tohoto rozložení. To znamená například z jakých se skládá obrazovek a jak jsou vůči sobě rozestavěné ve fyzickém světě.\n\nV sekci ServerLayout se již odkazuje na názvy obrazovek ze sekce `Screen`. Těchto sekcí může být v souboru více, pokud X server běží na více obrazovkách. Sekce Screen obsahuje nastavení jedné obrazovky. Nastavuje se zde barevná hloubka obrazovky, z jakého zařízení jde na obrazovku obraz, atp.\n\nZařízení ze kterého jde obraz na obrazovku je definováno v sekci `Device`. Tato sekce obsahuje informace vetšinou o grafické kartě, používaném ovladači pro tuto kartu a jak by se měl ovladač chovat.\n\nNež se vrhneme do změn v souboru xorg.conf, tak uvedu dvě věci.\n0. Před jakýmikoliv změnami si je dobré si udělat kopii tohoto souboru, aby bylo k čemu se vracet, při špatném nastavení X serveru\n0. Do konfigurace toho pište co nejméně. Jak je vidět z <a href=\"https://gist.github.com/777004#file_xorg.0.log\">mého logu</a>, tak X server si toho dost nadetekuje sám\n\n### Nastavení více obrazovek\n\nNa to aby X server vykresloval na dvě obrazovky je potřeba definovat mu dva zdroje obrazu( sekce Device ). U mého notebooku se jedná o jednu grafickou kartu, takže obě dvě sekce instruují k použití stejného ovladače a to `nvidia`. Aby bylo možné se později odkazovat na každou zvlášť, má každý výtup mé karty jiný identifikátor( volba Identifier ). Další čím se tato dvě zařízení liší je volba Screen. Zabudovaný display notebooku má tuto volbu nastavenu na 0( první zařízení ) a VGA výstup má volbu nastavenu na 1( druhé zařízení ).\n\n    Section \"Device\"\n        Identifier\t\"Default Device\"\n        Driver\t\"nvidia\"\n        Option\t\"NoLogo\"\t\"True\"\n        Screen\t0\n    EndSection\n\n    Section \"Device\"\n\t    Identifier\t\"External screen device\"\n\t    Driver\t\"nvidia\"\n\n\t    Screen 1\n    EndSection\n\nDalší věc kterou musíme udělat je vytvořit pro každou obrazovku, sekci Screen. Většinu voleb mám u displaye zabudovaného v NTB. Je zde opět identifikátor a dále barevná hloubka obrazovky. Volba `\"TwinView\" \"1\"` znamená, že poběží jeden X server a plocha jeho obrazu bude vykreslována na všech obrazovkách. V případě že by tato volba byla nahrazena za `\"Xinerama\" \"1\"`, běžel by na každé obrazovce samostatný X server. Volba Device říká z jakého zařízení na tuto obrazovku přichází obraz. Použivá se zde název definovaný v sekci Device volbou `Identifier`.\n\n    Section \"Screen\"\n\t    Identifier\t\"Default Screen\"\n\t    DefaultDepth\t24\n\n\t    Option \"TwinView\" \"1\"\n\n\t    Device\t\"Default Device\"\n    EndSection\n\n    Section \"Screen\"\n\t    Identifier\t\"External Screen\"\n\t    DefaultDepth\t24\n\n\t    Device \"External screen device\"\n    EndSection\n\nRestartovaní X serveru v tuto chvíli by mělo vést k jeho spuštění přes dvě obrazovky. Později si ukážeme jak mezi těmito režimi přecházet bez restartovaní. Nemusíme se bát spuštění X pokud nebudeme mít připojen externí monitor. X budou vykreslovat na dva monitory, pouze pokud budou oba připojené při startu. To znamená, že pokud externí obrazovku nepřipojíme před startem, tak s ním nebude pracovat ani X server.\n\n### Přepínání více-monitorovosti\n\nPokud si nyní budeme chtít odnést notebook někam kde již náše externí obrazovka nebude připojena, tak bychom ho museli \"Disablovat\" přes `nvidia-settings`. Nastavení X serveru nám však umožňuje nastavit si takzvané `metamodes`. Jedná se o předvolby nastavení obrazovek. V mém případě jsem si nastavil metamodes nasludujícně.\n\n    Option \"metamodes\" \n        \"CRT: nvidia-auto-select +0+0, \n         DFP: nvidia-auto-select +1024+0; \n         \n         CRT: null, \n         DFP: nvidia-auto-select +0+0\"\n\n(Já jsem příklad zalomil do více řádků kvůli prostoru, ale toto nastavení by samozřejmě mělo být tak jak je to v souborech odkazovaných v hlavičce)\n\nJe zde schéma\n\n0.  Externí monitor( CRT ) je úplně vlevo a interní display( DFP ) je o 1024 pixelů dále. Obě obrazovky mají rozlišení automaticky detekované ovladačem. Toto schéma předpokládá, že má externí monitor rozlišení 1024xneco\n0.  Externí monitor( CRT ) je nepoužívaný( null ) a interní display( DFP ) je úplně vlevo. Interní display má rozlišení automaticky detekované ovladačem.\n\nMezi těmito schématy mohu přepínat programem `randr` a to konkrétně příkazem `xrandr -s 0` a `xrandr -s 1`. 0 pro první schéma a 1 pro druhé schéma. Pokud budeme mít schémat více, tak se bude číslo u parametru `-s` s každým takovým schématem zvedat o jednu;)\n\n### Pořadí zobrazujících zařízení\n\nZ počátku používání více monitorů na NTB mě trápilo umístění lišt o oken po přepnutí do více obrazovkového režimu. Zkrátka a dobře jsem měl okna a lišty na externím monitoru. To se dalo řešit vypnutím a zapnutím vestavěného displaye NTB, ale samozřejmě jsem to bral jako workarround. Toto chování se dá ovlivnit volbou `TwinViewXineramaInfoOrder` v konfiguraci X serveru. Tato volba určuje pořadí v jakém jsou monitory/displaye označeny. Taková volba vypadá zhruba takto:\n\n    Option         \"TwinViewXineramaInfoOrder\" \"DFP-0, CRT-0\"\n\n`DFP-0` je prvním zobrazovacím zařízením a `CRT-0` je druhým. Ve většině případů by mělo fungovat toto nastavení. Je samozřejmě možné, že se názvy zařízení budou lišit pokud se zobrazuje přes TV out, či jiný out;). Já jsem zjistil svá zařizení z [logu X serveru](https://gist.github.com/777004#LC149 \"Odkaz na řádek v mém logu\").\n\n### Závěrem\n\nJsem rád, že jsem se konečně dostal k tomu si toto nastavit. Když doma zapnu počítač, tak jedu automaticky i na externím monitoru, když externí monitor nepotřebuji, tak si ho klávesovou zkratkou vypnu. Jediné co mě zklamalo je, že toto nastavení mi již tak dobřé neslouží, pokud si například v práci připojím projektor. \nV tomto postu popíši jak na notebooku s Ubuntu 10.10 nastavit fungování s externím zobrazovacím zařízením( ve většině případů se bude jednat o monitor/display ). Koho nezajímá omáčka a chce rovnou soubor xorg.conf tak je k dispozici na adrese&nbsp;<a href=\"https://gist.github.com/gists/777004/download\">https://gist.github.com/gists/777004/download</a>,&nbsp;k prohlédnutí pak na adrese&nbsp;<a href=\"https://gist.github.com/777004\">https://gist.github.com/777004</a>. Na odkazech jsou dva soubory. Původní soubor, který jsem měl na začátku( xorg.conf-default ) a soubor xorg.conf, který vznikl postupným nastavováním. V tomto postu se budu zabývat tím jaký má rozdíl mezi těmito soubory význam. Pro úplnost je přiložen i poslední log nastavovaného X serveru &ndash; <a href=\"https://gist.github.com/777004#file_xorg.0.log\">Xorg.0.log</a>."},{"identifier":"VPN server na MOX Lion (10.7)","title":"VPN server na MOX Lion (10.7)","content_blob":"Předesílám, že během postupu bude dost možná vyžadován restart celého systému. Editace souborů jsem prováděl přes `mate <názav souboru>`. Systém se pak při ukládání zeptal na zda uložení souboru posvětím svými přihlašovacími údaji.\n\n### Nastavení VPN serveru\n\nMOX v desktopové verzi obsahuje server VPN, akorát k němu není automaticky k dispozici hezké GUI jako je tomu v případě MOX Server. Spustitelný soubor VPN serveru - `vpnd`, příjmá jako parametr jak se má chovat po spuštění serveru a id serveru, který chceme spustit. Nový server si nadefinujeme v /Library/Preferences/SystemConfiguration/com.apple.RemoteAccessServers.plist nasledujícím obsahem\n\n    {\n        ActiveServers = (\"com.apple.ppp.l2tp\");\n        Servers = {\n            \"com.apple.ppp.l2tp\" = {\n                Addresses = (\"XXX.XXX.XXX.XXX\");\n                DNS = {OfferedSearchDomains = (); OfferedServerAddresses = (); };\n                IPv4 = {\n                    ConfigMethod = Manual;\n                    DestAddressRanges = (\"YYY.YYY.YYY.YYY\", \"ZZZ.ZZZ.ZZZ.ZZZ\");\n                    OfferedRouteAddresses = ();\n                    OfferedRouteMasks = ();\n                    OfferedRouteTypes = ();\n                };\n                Interface = {SubType = L2TP; Type = PPP; };\n                L2TP = {\n                    IPSecSharedSecret = \"com.apple.ppp.l2tp\";\n                    IPSecSharedSecretEncryption = Keychain;\n                    Transport = IPSec;\n                };\n                PPP = {\n                    AuthenticatorPlugins = (DSAuth);\n                    AuthenticatorProtocol = (MSCHAP2);\n                    IPCPCompressionVJ = 0;\n                    LCPEchoEnabled = 1;\n                    LCPEchoFailure = 5;\n                    LCPEchoInterval = 60;\n                    VerboseLogging = 1;\n                    DSACLEnabled = 1;\n                    Logfile = \"/var/log/ppp/vpnd.log\";\n                };\n                Server = {\n                    Logfile = \"/var/log/ppp/vpnd.log\";\n                    MaximumSessions = 128;\n                    VerboseLogging = 1;\n                };\n            };\n        };\n    }\n\nZnát význam celého souboru není v tuto chvíli potřeba. Je potřeba nahradit XXX.XXX.XXX.XXX IP adresou na které VPN server poběží a \"YYY.YYY.YYY.YYY\", \"ZZZ.ZZZ.ZZZ.ZZZ\" hranicemi rozsahu adres, ze kterého může `vpnd` přiřazovat. IP adresa počítače se na MOX zjití příkazem `ifconfig`. Hledejte řádek podbný `inet 192.168.5.10`\n\nDále je potřeba nadefinovat službu pro launchd. Definici souboru umístíme do souboru `/System/Library/LaunchDaemons/com.apple.ppp.l2tp.plist`.\n\n    <?xmlversion=\"1.0\"encoding=\"UTF-8\"?>\n    <!DOCTYPE plist PUBLIC \"-//Apple//DTD PLIST 1.0//EN\" \"http://www.apple.com/DTDs/PropertyList-1.0.dtd\">\n    <plistversion=\"1.0\">\n        <dict>\n            <key>Label</key>\n            <string>com.apple.ppp.l2tp</string>\n            <key>ProgramArguments</key>\n            <array>\n                <string>/usr/sbin/vpnd</string>\n                <string>-x</string>\n                <string>-i</string>\n                <string>com.apple.ppp.l2tp</string>\n            </array>\n            <key>OnDemand</key>\n            <false/>\n        </dict>\n    </plist>\n    \nNyní by melo být možné spustit službu VPN serveru nasledujícím příkazem\n\n    launchctl load /System/Library/LaunchDaemons/com.apple.ppp.l2tp.plist\n\nPřihlašování k VPN serveru probíha přes uživatelské jméno a uživatelské heslo. Nechtěl jsem dávat v šanc svůj vlastní uživatelský účet, tak jsem si vytvořil nový, jenom pro učely přihlašování k serveru. Na konci postu budu mluvit ještě o jedné věci, kvůli které jsem radši, že mám zvlášť účet na VPN.\n\nZatím poslední věc kterou musíme udělat na počítačí, ktery bude sloužit jako VPN server, je nastavení sdíleného klíče pro přihlášení na VPN server.\n\n    sudo security add-generic-password -a com.apple.ppp.l2tp \\\n        -s com.apple.net.racoon -T /usr/sbin/racoon -p \"sdileny klic\" \\\n        /Library/Keychains/System.keychain\n\nSdílený klíč je v této ukázce \"sdileny klic\" ;)\n\nNásledujícím příkazem je možné sledovat co se ve VPN serveru děje.\n\n    tail -f /var/log/ppp/vpnd.log\n\nDá se zde například zjistit, jakou IP adresu ziskal počítač připojující se k serveru a obecně co se dělo při připojování. Toho využiji v závěru postu.\n\n### Nastavení klienta\n_iPod touch -- 4.3.5 (8L1)_\n\nV aplikaci pro nastavení se VPN server přidá v cestě VPN > Přidat konfiguraci VPN...\n\n- Typ připojení(Horní taby) : L2TP\n- Server: &lt;IP adresa serveru na kterém je nastaven VPN server>\n- Účet: &lt;uživatelský účet zamýšlený k přihlašování na VPN>\n- RSA SecureId: Vypnuto\n- Heslo: &lt;uživatelské heslo k účtu>\n- Sdílený klíč: &lt;sdílený klíč nastavený v závěru nastavování serveru>\n- Odeslat vše: Zapnuto\n \n- Proxy (Taby úplně dole):  Vypnuto\n\nTlačítkem uložit, uložíme konfiguraci a přesuneme se na hlavní obrazovku správy VPN spojení. Tapnutím na nově vytvořené spojení se pouze zvolí jako používané. Samotný pokus o připojení probíhá až po aktivaci položky VPN v horní části obrazovky. Pokud vše dopadlo dobře, tak vám nyní na obrazovce beží čas jak dlouho jste k VPN připojeni.\n\n### MCHAP fix\n\nJá štěstí neměl a objevila se mi hláška o chybě autentizace. Pro ty z vás, které potkalo to samé tedy jesště jeden a snad i poslední krok.\n\nU mě se chyba projevila následujícím textem v logu vpnd\n\n    Thu Sep 22 12:52:35 2011 : CHAP peer authentication failed for vpnuser\n\nPravděpodobně se bude lišit časová značka a jméno přihlašujícího se užitele, které je na konci řádku. Řešení chyby je ukryto v komentářích původního článku.\n\n    dscl . change /users/vpnuser AuthenticationAuthority ';ShadowHash;HASHLIST:<SALTED-SHA512,SMB-NT>' ';ShadowHash;HASHLIST:<SALTED-SHA1,SMB-NT,SMB-LAN-MANAGER>'\n\nDscl je teminálový nástroj na správu domén. Když se podíváme do manuálové stránky, tak si můžeme přeložit předchozí přikaz jako\n\n    dscl . <operace> <cesta k datům> <klíč v datech> <původní hodnota klíče> <nová hodnota klíče>\n\nPuvodní hodnota pravděpodobně bude odlišná od mnou uvedené. Pokud se pokusíte zavolat příkaz s chybnout původní hodnotou, tak vám to dá dscl vědět hláškou podobnou této\n\n    <main> attribute status: eDSAttributeNotFound\n    <dscl_cmd> DS Error: -14134 (eDSAttributeNotFound)\n\nAktuální původní hodnotu je potřeba zjistit přes následující přikaz\n\n    dscl . read /users/vpnuser AuthenticationAuthority\n\nDscl vrátí celé AuthenticationAuthority. Nás z něj zajímá akorát ShadowHash. Po úspěšné změne údajů, o kterém vás `dscl` informuje tím, že nevypíše zhola nic, by již mělo spojení proběhnou bez potíží.\n\n### DNS\n\nVPN server může sloužit i pro běžné prohlížení internetu, či kontaktování ostatních strojů pomocí doménových jmen. V konfiguraci (soubor `com.apple.RemoteAccessServers.plist`) se uvedou IP adresy DNS serverů.\n\n    DNS = {OfferedSearchDomains = (“mojedomena.cz”); OfferedServerAddresses = (\"8.8.8.8\"); };\n\nV ukazce je IP adresa [Google Public DNS](http://code.google.com/speed/public-dns/docs/using.html) pro IPv4. \n\n### Závěrem\n\nDoufám, že bude tento post někomu nápomocen. Pokud by v něm byly nějaké chyby, nepřesnosti, či nejasnosti, tak se o nich rád dovím přes komentáře pod postem. \n\nPoslední věta před zveřejněním. Tento post byl puvodne napsán 27.9.2011, ale nějak mi zapadly dodatečné úpravy a kontrola postu. Doufám, že někdy mezi tím nikdo tento post životně nutně nepotřeboval ;)V tomto postu popisuji jak si na desktopovém MacOS X Lion rozjet VPN server. Já osobně si od toho slibuji OTA sync i když nebudu na jedné síti se svým iOS zařízením. Náplň postu je z většiny překlad souhrnu článku a komentářů na http://blog.theilluminatedengineer.com/?p=136."},{"identifier":"Rvm a rbenv","title":"Rvm a rbenv","content_blob":"### O co jde?\n\nJak rbenv, tak rvm jsou nástroje na správu verzí a prostředí ruby. V praxi to znamená, že vám tyto nástroje umožní přepínat mezi nainstalovanými verzemi ruby. To se hodí pokud je potřeba na jednom počítači pracovat s projekty v různych verzích ruby.\n\nPříklad:\n\n1. Projekt -- Ruby Enterprise Edition\n2. Projekt -- Ruby 1.9.2\n3. Projekt -- Ruby 1.9.3\n\nDokud bychom chtěli jenom Ruby 1.8 a 1.9, tak nám stačí jednu z verzí zkompilovat se sufixem verze a máme vystaráno. Problémem může být, že si každý zkompiluje sufixy jinak. Další věc je, že vývojář musí střídat verze tim jaký příkaz volá `ruby` / `ruby19` / `ruby1.8`. Oba zde popisované nástroje za vás tento problém vyřeší tím, že vám poskytnou prostředí ve kterých máte jenom jedno ruby a mezi těmito prostředími se můžete snadno přepínat buď příkazem, nebo automatizovanou konfigurací.\n\n### Rvm\n[Stránky projektu](http://beginrescueend.com/)\n\nRvm je kompletní systém na správu verzí ruby. Jedním příkazem se z internetu stáhnou a zkompilují zdrojové kódy chtěné verze ruby, či se vytvoří sada gemů, která bude sloužit pouze pro jeden projekt a nebo pro celou verzi ruby. Bylo by otravné přepínat verzi ruby pokaždé, když přejdu do nějakého projektu. To řeší rvm dvěma cestami. Budťo se příkazem nastaví defaultní ruby pro celý systém a nebo se pro daný adresář/projekt vygeneruje jiným příkazem soubor `.rvmrc`. Po tomto souboru se rvm při vstupu do adresáře poohlíží a v případě, že ho najde tak podle něj nastaví aktuální prostředí. Toto nastavení zahrnuje verzi ruby a volitelně i gemset (používaná sada gemů). Pokud by nebylo psaní do terminálu po chuti, tak má rvm celkem i povedené GUI [JewelryBox](http://unfiniti.com/software/mac/jewelrybox) pro systém Mac OS X.\n\nCo se týče instalace, tak je určitě jednodušší rvm, kde se pouze do terminálu zkopíruje příkaz ze stránek projektu a je nainstalováno. Jednodušší je v rvm také instalace jednotlivých ruby verzí. Pokud chci v rvm například nainstalovat ruby-1.9.2, stačí mi jako verzi zadat pouze 1.9.2 a automaticky se instaluje verze ruby-1.9.2-p290, která je aktuální stable. To samé například s ree a ree-1.8.7-2011.12.\n\n### Rbenv\n[Stránky projektu](https://github.com/sstephenson/rbenv)\n\nRbenv si klade mnohem menší cíle a slouží pouze k přepínání verzí ruby. Neobsahuje tedy ani instalaci ruby ani správu gemsetů. Již v základu funguje automatické přepínání verzí na základě definičního souboru v projektu/adresáři. Oproti rvmrc, kde jde o sofistikovanější skript, se jedná o prostý soubor (`.rbenv-version`) obsahující pouze název ruby, které se má použít.\n\nPokud bychom chtěli, aby nám rbenv i instaloval jednotlivé verze ruby, dopomůže nám k tomu jiný nástroj od autora rbenv a to [ruby-build](https://github.com/sstephenson/ruby-build). Tento nástroj se instaluje naklonováním repozitáře a spuštěním instalačního skriptu v nově naklonovaném repozitáři. Podobně jde doinstalovat i podpora gemsetů, naklonováním [rbenv-gemset](https://github.com/jamis/rbenv-gemset) do adresáře `~/.rbenv/plugins`.\n\nV případě rbenv je nutné při instalaci uvést celé jméno verze, kterou chceme nainstalovat a celou verzi pak psát i při další práci s daným ruby. Proto je vhodné pro projekty/adresáře používat dříve zmíněné definiční soubory pro chtěnou verzi ruby.\n\n### Závěrem\n\nRbenv je oproti rvm o dva roky mladší a jistě neposkytuje tak bohatý systém pro správu verzí, ale jeho velké plus je jednoduchost, rychlost a ekologie;) Jedna z věcí, které občas uživatelům rvm vadí je, že core příkazy rvm implementuje jako funkce v shellu. Naproti tomu rbenv jde cestou jednoho adresáře se \"spustitelnými soubory\", který je v path a \"spustilné soubory\" jsou ve skutečnosti jen linky na spustistelné soubory z právě potřebné verze ruby.\nV tomto postu píši o způsobu fungování dvou pro mě nejznámějších manažerů Ruby verzí a prostředí."},{"identifier":"Git - Kdiff3 na MOX Lion","title":"Git - Kdiff3 na MOX Lion","content_blob":"### O co jde?\n\nPři práci více lidí na jednom repositáři se celkem běžně stane, že dojde k takzvanému merge konfliktu. Jedná se o stav, kdy již originál našich změn neexistuje, tedy že nás někdo se změnami na daném místě \"předběhl\". Ve verzovacím systému Git k tomu dochází například při použití při příkazu [merge](http://schacon.github.com/git/git-merge.html), či [pull](http://schacon.github.com/git/git-pull.html). Výsledný konflikt se řeší buďto ručně v textovém editoru, nebo pomocí příkazu [mergetool](http://schacon.github.com/git/git-mergetool.html). Tento post popisuje jak zařídit, aby příkaz `git mergetool` použil nástroj [Kdiff3](http://kdiff3.sourceforge.net/). Tento postup byl již na internetu mnohokráte popsán, ale přijde mi že všechny mnou nalezené návody jsou až zbytečně složité. Kdyby to nebylo tak úplně jasné, tak celá konfigurace probíhá v terminálu.\n\n### Příprava\n\n- Ze stránek [Kdiff3](http://kdiff3.sourceforge.net/) si [stáhneme aplikaci pro Mac](http://sourceforge.net/projects/kdiff3/files/latest/download). Mělo by se jednat o klasickou Mac aplikaci (adresář s příponou app).\n- Zjistíme si které adresáře máme v path -- `echo $PATH`\n- Naklonujeme si repozitář pro testování merge konfliktu -- `git clone git://github.com/roolo/merge-with-conflict.git`\n\n### Nastavujeme Git\n\nV adresáři testovacího projektu spustíme mergování větve, obsahující konfliktní změny.\n\n    $ git merge origin/side-changes\n    Auto-merging TextFile\n    CONFLICT (content): Merge conflict in TextFile\n    Automatic merge failed; fix conflicts and then commit the result.\n\nVyvolaná zpráva by se měla dost podobat té mé, pokud nebude úplně stejná. Říká nám, že se Gitu nepodařilo změny sloučit automaticky a je potřeba interakce uživatel (to je v tomto případě dobře;)). Máme tedy náš testovací merge konflikt. Zkusíme teď tento konflikt vyřešit příkazem `mergetool`.\n\n    $ git mergetool\n    merge tool candidates: opendiff kdiff3 tkdiff xxdiff meld tortoisemerge gvimdiff diffuse ecmerge p4merge araxis bc3 emerge vimdiff\n    Merging:\n    TextFile\n\n    Normal merge conflict for 'TextFile':\n      {local}: modified file\n      {remote}: modified file\n    Hit return to start merge resolution tool (opendiff):\n\nGit nám teď říká, že budeme řešit mergovací konflikt, ale že neví jaký nástroj použít a nabízí nám příkaz opendiff. Příkaz opendiff na MacOS X otevře diffovací nástroj zvolený prostředím Xcode. V defaultu se jedná o aplikaci FileMerge. Hned v prvním řádku výpisu můžeme vidět co jiného se dá na vyřešení našeho mergovacího konfliktu použít. Mezi jiným zde vidíme i kdiff3. Nastavíme tedy kdiff3 jako mergovací nástroj a zkusíme to znovu.\n\n    $ git config --global merge.tool kdiff3\n    $ git mergetool\n    Merging:\n    TextFile\n\n    Normal merge conflict for 'TextFile':\n      {local}: modified file\n      {remote}: modified file\n    Hit return to start merge resolution tool (kdiff3): \n    The merge tool kdiff3 is not available as 'kdiff3'\n\nV tomto případě již Git ví, že má použít kdiff3, ale nemůže ho najít. V tuto chvíli vstupuje do hry aplikace stažená v sekci příprava. Nakopírujeme tuto aplikaci (kdiff3) do složky `/Applications`. V tuto chvíli je již kdiff3 mezi ostatními aplikacemi, kam patří a po chvíli by se i mohl zobrazit v Launchpadu. Bohužel to Gitu stačit nebude. Ten hledá spustitelný soubor obsažený v adresáři vyjmenovaném v proměnné PATH. Přejdeme tedy v terminálu do některého z dříve zjištěných adresářů a vytvoříme zde link na spustitelný **soubor** kdiffu. Ideálně by se mělo jednat o cestu končící `/bin`. V mém případě volba padla na adresář `/opt/local/bin/`. Poté zkusíme zase spustit `mergetool`.\n\n    $ cd /opt/local/bin\n\t$ sudo ln /Applications/kdiff3.app/Contents/MacOS/kdiff3\n    Password:\n    $ git mergetool \n    Merging:\n    TextFile\n\n    Normal merge conflict for 'TextFile':\n      {local}: modified file\n      {remote}: modified file\n    Hit return to start merge resolution tool (kdiff3): \n\nV tuto chvíli jsme na konci naší cesty. Git ví, že na vyřešení merge konfliktu chceme použít nástroj kdiff3, spustí ho a ten už na nás cení porovnávací panely. Přeji hodně nepravděpodobně šťastných chvil při jeho užívání. Ne snad, že by kdiff3 byl špatný nástroj, naopak. Ale když už dojde na potřebu interakce uživatele při mergi, tak už se většinou jedná o nějakou zapeklitost.\nV tomto postu píši o tom jak si na MacOS X Lion nastavit mergovací nástroj Kdiff3 jako mergtool pro verzovací systém Git"},{"identifier":"Automatické labely ve Finderu","title":"Automatické labely ve Finderu","content_blob":"### O co jde?\nKaždý soubor, či adresář je možné ve Finderu označit barevným labelem. Výber barvy je možný v kontextové nabídce souboru / adresáře. V současné verzi Mac OS X -- Lion je možné nadefinovat adresářům při změně obsahu, spuštění zvoleného AppleScriptu. V postu se bude dost používat přecházení mezi adresářemi, takže tomu kdo o ní neví povím o klávesové zkratce &#x2318;&#x21E7;+g, která slouží ke skoku do zadaného adresáře. Jako bonus podporuje doplňování tabulátorem. Kdo to nechce zkoušet na vlastní Mac, tomu poslouží [video ukázka](http://youtu.be/QO6bCYQWPYA)\n\n### Jak na to\nVytvoříme si adresář `/tmp/fa-test`. Vytvoříme soubor pro AppleScript -- aplikace \"AppleScript Editor\" zatím klidně prázdný a uložíme ho do adresáře `~/Library/Scripts/Folder Action Scripts` s názvem souboru `add - yellowize`. Pokud adresář neexistuje, tak ho vytvořit. Nyní otevřeme nastavení akcí adresáře -- &#x2303;+klik na adresář `fa-test` a zvolit `Folder Actions Setup...`. Ihned po spuštění nástroje budeme dotázáni jaký skript chceme adresáři přiřadit. Zvolíme náš `add - yellowize` a potvrdíme tlačítkem Attach. Po zavření okna pro nastavení akcí adresáře se vrátíme zpět do AppleScript editoru. Náš skript naplníme následujícím obsahem.\n\n    on adding folder items to this_folder after receiving these_items\n    \ttell application \"Finder\"\n    \t\trepeat with one_item in these_items\n    \t\t\tset label index of one_item to 3\n    \t\tend repeat\n    \tend tell\n    end adding folder items to\n\nObsah je celkem samo popisný. Jediné co je trochu nejasné, je číslo tři. Toto číslo se dá odvodit z kontextové nabídky souboru / adresáře, kde za sebou vidíme jednotlivé barvy. Číslo 4 by tedy byla barva zelená. Soubor uložíme a když teď nahrajeme nějaký testovací soubor do adresáře `/tmp/fa-test`, tak se nám označí žlutě.\nJak si zařídit, aby se nově přidané položky ve složce označovaly barevným labelem. To se může hodit například pokud máte adresář s dokumenty, které chcete projít -- žluté nové, zelené projduté."}]}
